name: "object_detector"
platform: "onnxruntime_onnx"
max_batch_size: 4

input [
  {
    name: "images"
    data_type TYPE_FP32
    dims: [640 640 3]
  }
]

output [
  {
    name: "boxes"
    data_type: TYPE_FP32
    dims: [-1, 4]
  }
  {
    name "scores"
    data_type: TYPE_FP32
    dims: [-1]

]

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }

dynamic_batching {
  preferred_batch_size: [1, 2, 4]
  max_queue_delay_microseconds: 100