[
  {
    "token":"the",
    "id":0
  },
  {
    "token":"a",
    "id":1
  },
  {
    "token":"an",
    "id":2
  },
  {
    "token":"is",
    "id":3
  },
  {
    "token":"are",
    "id":4
  },
  {
    "token":"was",
    "id":5
  },
  {
    "token":"were",
    "id":6
  },
  {
    "token":"has",
    "id":7
  },
  {
    "token":"have",
    "id":8
  },
  {
    "token":"customer",
    "id":9
  },
  {
    "token":"issue",
    "id":10
  },
  {
    "token":"reported",
    "id":11
  },
  {
    "token":"data",
    "id":12
  },
  {
    "token":"information",
    "id":13
  },
  {
    "token":"system",
    "id":14
  },
  {
    "token":"error",
    "id":15
  },
  {
    "token":"please",
    "id":16
  },
  {
    "token":"help",
    "id":17
  },
  {
    "token":"need",
    "id":18
  },
  {
    "token":"support",
    "id":19
  },
  {
    "token":"ticket",
    "id":20
  },
  {
    "token":"and",
    "id":21
  },
  {
    "token":"or",
    "id":22
  },
  {
    "token":"but",
    "id":23
  },
  {
    "token":"with",
    "id":24
  },
  {
    "token":"for",
    "id":25
  },
  {
    "token":"from",
    "id":26
  },
  {
    "token":"to",
    "id":27
  },
  {
    "token":"in",
    "id":28
  },
  {
    "token":"on",
    "id":29
  },
  {
    "token":"at",
    "id":30
  },
  {
    "token":"by",
    "id":31
  },
  {
    "token":"of",
    "id":32
  },
  {
    "token":".",
    "id":33
  },
  {
    "token":":",
    "id":35
  },
  {
    "token":";",
    "id":36
  },
  {
    "token":"?",
    "id":37
  },
  {
    "token":"!",
    "id":38
  },
  {
    "token":"[",
    "id":39
  },
  {
    "token":"]",
    "id":40
  },
  {
    "token":"account",
    "id":41
  },
  {
    "token":"password",
    "id":42
  },
  {
    "token":"email",
    "id":43
  },
  {
    "token":"phone",
    "id":44
  },
  {
    "token":"address",
    "id":45
  },
  {
    "token":"payment",
    "id":46
  },
  {
    "token":"card",
    "id":47
  },
  {
    "token":"service",
    "id":48
  },
  {
    "token":"problem",
    "id":49
  },
  {
    "token":"request",
    "id":50
  }
]