[PAD]
[UNK]
[MASK]
[CLS]
[SEP]
the
and
is
of
to
in
for
on
with
at
by
from
as
that
this
it
be
are
was
were
been
being
have
has
had
do
does
did
will
would
should
could
may
might
can
must
shall
a
an
one
two
three
four
five
six
seven
eight
nine
ten
hundred
thousand
million
billion
first
second
third
last
next
new
old
good
bad
great
small
large
big
little
long
short
high
low
early
late
best
better
worse
worst
more
most
less
least
very
too
so
just
only
also
even
well
much
many
some
any
all
both
each
every
other
another
same
different
such
own
right
left
up
down
out
over
under
above
below
through
between
among
into
onto
off
away
back
here
there
where
when
while
before
after
during
since
until
now
then
today
yesterday
tomorrow
year
month
week
day
hour
minute
second
time
times
way
ways
people
person
man
men
woman
women
child
children
boy
girl
family
friend
friends
group
world
country
countries
state
states
city
cities
town
place
home
house
room
school
college
university
work
job
life
hand
hands
eye
eyes
head
face
body
part
parts
side
back
front
end
point
case
fact
question
problem
number
system
program
company
business
service
product
technology
computer
data
information
science
research
study
report
book
books
paper
article
page
word
words
line
lines
text
name
idea
thing
things
area
level
order
use
used
using
make
makes
made
making
take
takes
took
taken
taking
come
comes
came
coming
go
goes
went
gone
going
see
sees
saw
seen
seeing
know
knows
knew
known
knowing
get
gets
got
gotten
getting
give
gives
gave
given
giving
find
finds
found
finding
tell
tells
told
telling
ask
asks
asked
asking
work
works
worked
working
seem
seems
seemed
seeming
feel
feels
felt
feeling
try
tries
tried
trying
leave
leaves
left
leaving
call
calls
called
calling
put
puts
putting
mean
means
meant
meaning
keep
keeps
kept
keeping
let
lets
letting
begin
begins
began
begun
beginning
help
helps
helped
helping
show
shows
showed
shown
showing
hear
hears
heard
hearing
play
plays
played
playing
run
runs
ran
running
move
moves
moved
moving
live
lives
lived
living
believe
believes
believed
believing
bring
brings
brought
bringing
happen
happens
happened
happening
write
writes
wrote
written
writing
sit
sits
sat
sitting
stand
stands
stood
standing
lose
loses
lost
losing
pay
pays
paid
paying
meet
meets
met
meeting
include
includes
included
including
continue
continues
continued
continuing
set
sets
setting
learn
learns
learned
learning
change
changes
changed
changing
lead
leads
led
leading
understand
understands
understood
understanding
watch
watches
watched
watching
follow
follows
followed
following
stop
stops
stopped
stopping
create
creates
created
creating
speak
speaks
spoke
spoken
speaking
read
reads
reading
allow
allows
allowed
allowing
add
adds
added
adding
spend
spends
spent
spending
grow
grows
grew
grown
growing
open
opens
opened
opening
walk
walks
walked
walking
win
wins
won
winning
offer
offers
offered
offering
remember
remembers
remembered
remembering
love
loves
loved
loving
consider
considers
considered
considering
appear
appears
appeared
appearing
buy
buys
bought
buying
wait
waits
waited
waiting
serve
serves
served
serving
die
dies
died
dying
send
sends
sent
sending
expect
expects
expected
expecting
build
builds
built
building
stay
stays
stayed
staying
fall
falls
fell
fallen
falling
cut
cuts
cutting
reach
reaches
reached
reaching
kill
kills
killed
killing
raise
raises
raised
raising
pass
passes
passed
passing
sell
sells
sold
selling
require
requires
required
requiring
report
reports
reported
reporting
decide
decides
decided
deciding
pull
pulls
pulled
pulling
return
returns
returned
returning
explain
explains
explained
explaining
hope
hopes
hoped
hoping
develop
develops
developed
developing
carry
carries
carried
carrying
break
breaks
broke
broken
breaking
receive
receives
received
receiving
agree
agrees
agreed
agreeing
support
supports
supported
supporting
hit
hits
hitting
produce
produces
produced
producing
eat
eats
ate
eaten
eating
cover
covers
covered
covering
catch
catches
caught
catching
draw
draws
drew
drawn
drawing
choose
chooses
chose
chosen
choosing
cause
causes
caused
causing
point
points
pointed
pointing
indicate
indicates
indicated
indicating
suggest
suggests
suggested
suggesting
represent
represents
represented
representing
focus
focuses
focused
focusing
foreign
national
political
social
economic
financial
medical
legal
public
private
international
local
general
common
particular
certain
possible
available
important
necessary
significant
major
minor
main
primary
secondary
basic
fundamental
essential
critical
key
central
special
specific
individual
personal
professional
technical
practical
natural
human
physical
mental
emotional
cultural
historical
traditional
modern
contemporary
current
recent
past
future
present
potential
actual
real
true
false
positive
negative
active
passive
direct
indirect
full
empty
complete
incomplete
whole
entire
total
final
initial
original
usual
unusual
normal
abnormal
regular
irregular
standard
average
typical
unique
rare
common
frequent
constant
continuous
temporary
permanent
stable
unstable
fixed
variable
strong
weak
hard
soft
heavy
light
dark
bright
clear
unclear
simple
complex
easy
difficult
possible
impossible
likely
unlikely
similar
different
equal
unequal
related
unrelated
dependent
independent
internal
external
upper
lower
northern
southern
eastern
western
digital
analog
electric
electronic
mechanical
chemical
biological
nuclear
solar
lunar
global
regional
urban
rural
industrial
agricultural
commercial
residential
educational
medical
military
civil
criminal
legal
illegal
formal
informal
official
unofficial
public
private
open
closed
free
restricted
limited
unlimited
maximum
minimum
optimal
sufficient
insufficient
adequate
inadequate
appropriate
inappropriate
relevant
irrelevant
consistent
inconsistent
accurate
inaccurate
precise
imprecise
correct
incorrect
valid
invalid
effective
ineffective
efficient
inefficient
successful
unsuccessful
productive
unproductive
beneficial
harmful
useful
useless
valuable
worthless
important
unimportant
significant
insignificant
necessary
unnecessary
essential
nonessential
required
optional
mandatory
voluntary
automatic
manual
digital
physical
virtual
actual
theoretical
practical
abstract
concrete
general
specific
broad
narrow
wide
thin
thick
deep
shallow
smooth
rough
flat
curved
straight
bent
round
square
circular
rectangular
triangular
horizontal
vertical
diagonal
parallel
perpendicular
adjacent
opposite
near
far
close
distant
local
remote
central
peripheral
interior
exterior
inner
outer
top
bottom
front
rear
forward
backward
upward
downward
inward
outward
clockwise
counterclockwise
left
right
middle
center
edge
corner
surface
bottom
ground
floor
ceiling
wall
door
window
roof
building
structure
facility
equipment
device
machine
tool
instrument
apparatus
mechanism
system
network
framework
platform
infrastructure
architecture
design
model
prototype
version
edition
release
update
upgrade
patch
fix
bug
error
mistake
fault
defect
flaw
problem
issue
challenge
difficulty
obstacle
barrier
constraint
limitation
restriction
requirement
specification
standard
criterion
measure
metric
indicator
parameter
variable
factor
element
component
part
piece
unit
module
section
segment
portion
fraction
percentage
ratio
proportion
rate
speed
velocity
acceleration
momentum
force
energy
power
strength
pressure
tension
stress
strain
load
weight
mass
volume
capacity
density
temperature
heat
cold
warm
cool
hot
freezing
boiling
melting
solid
liquid
gas
plasma
matter
material
substance
element
compound
mixture
solution
suspension
colloid
atom
molecule
particle
electron
proton
neutron
nucleus
ion
isotope
radiation
radioactive
nuclear
atomic
molecular
cellular
organic
inorganic
synthetic
natural
artificial
raw
processed
refined
pure
impure
clean
dirty
fresh
stale
new
used
original
copy
duplicate
replica
model
sample
specimen
example
instance
illustration
demonstration
proof
evidence
data
information
knowledge
fact
truth
reality
theory
hypothesis
assumption
premise
conclusion
result
outcome
effect
consequence
impact
influence
cause
reason
purpose
goal
objective
aim
target
intention
plan
strategy
approach
method
technique
procedure
process
operation
function
activity
action
task
job
duty
responsibility
role
position
status
condition
state
situation
circumstance
context
environment
setting
background
atmosphere
climate
weather
season
spring
summer
autumn
fall
winter
temperature
rainfall
snow
ice
wind
storm
hurricane
tornado
earthquake
flood
drought
fire
disaster
emergency
crisis
danger
risk
threat
hazard
safety
security
protection
defense
attack
offense
war
peace
conflict
battle
fight
struggle
competition
contest
race
game
sport
play
entertainment
fun
enjoyment
pleasure
happiness
joy
delight
satisfaction
content
comfort
ease
relaxation
rest
sleep
dream
wake
consciousness
awareness
attention
focus
concentration
thought
thinking
mind
brain
intelligence
wisdom
knowledge
understanding
comprehension
perception
sensation
feeling
emotion
mood
attitude
opinion
view
perspective
belief
faith
trust
confidence
doubt
uncertainty
fear
anxiety
worry
stress
tension
pressure
relief
calm
peace
serenity
tranquility
excitement
enthusiasm
passion
interest
curiosity
wonder
surprise
shock
amazement
astonishment
admiration
respect
appreciation
gratitude
thanks
praise
approval
acceptance
rejection
refusal
denial
opposition
resistance
support
assistance
help
aid
service
care
attention
treatment
therapy
medicine
drug
medication
prescription
dose
dosage
patient
doctor
nurse
physician
surgeon
specialist
hospital
clinic
laboratory
pharmacy
health
wellness
fitness
exercise
training
practice
skill
ability
capability
capacity
competence
proficiency
expertise
experience
qualification
credential
certificate
degree
diploma
education
learning
teaching
instruction
lesson
course
class
subject
topic
theme
issue
matter
question
answer
solution
resolution
settlement
agreement
contract
deal
arrangement
plan
project
initiative
program
scheme
proposal
suggestion
recommendation
advice
guidance
direction
instruction
command
order
request
demand
requirement
need
want
desire
wish
hope
expectation
anticipation
prediction
forecast
estimate
calculation
computation
analysis
evaluation
assessment
examination
inspection
investigation
research
study
survey
review
audit
test
trial
experiment
observation
measurement
record
documentation
report
account
description
explanation
interpretation
translation
conversion
transformation
change
modification
alteration
adjustment
adaptation
revision
correction
improvement
enhancement
optimization
upgrade
development
progress
advance
growth
expansion
extension
increase
rise
gain
profit
benefit
advantage
disadvantage
drawback
weakness
strength
merit
virtue
quality
characteristic
feature
attribute
property
trait
aspect
dimension
factor
criterion
standard
benchmark
reference
baseline
threshold
limit
boundary
range
scope
extent
scale
size
magnitude
amount
quantity
number
sum
total
aggregate
accumulation
collection
set
group
class
category
type
kind
sort
variety
diversity
difference
distinction
contrast
comparison
similarity
resemblance
correspondence
correlation
relationship
connection
link
association
bond
tie
attachment
affiliation
membership
participation
involvement
engagement
commitment
dedication
devotion
loyalty
allegiance
fidelity
faith
belief
conviction
certainty
assurance
guarantee
warranty
promise
pledge
vow
oath
commitment
obligation
duty
responsibility
accountability
liability
debt
credit
loan
interest
rate
fee
charge
cost
price
value
worth
expense
expenditure
spending
investment
saving
profit
loss
revenue
income
earnings
salary
wage
pay
payment
compensation
reward
bonus
incentive
motivation
encouragement
inspiration
stimulation
excitement
interest
appeal
attraction
charm
beauty
elegance
grace
style
fashion
trend
pattern
design
decoration
ornament
embellishment
detail
feature
element
component
ingredient
material
substance
content
composition
structure
organization
arrangement
configuration
layout
format
form
shape
figure
image
picture
photograph
photo
illustration
diagram
chart
graph
table
list
index
catalog
directory
database
file
document
record
archive
library
collection
repository
storage
warehouse
inventory
stock
supply
provision
resource
asset
property
possession
ownership
title
right
privilege
authority
power
control
influence
impact
effect
consequence
result
outcome
achievement
accomplishment
success
failure
victory
defeat
win
loss
triumph
disaster
fortune
luck
chance
opportunity
possibility
probability
likelihood
risk
danger
threat
challenge
obstacle
difficulty
problem
solution
answer
key
clue
hint
sign
signal
indication
symptom
evidence
proof
demonstration
display
exhibition
show
presentation
performance
act
action
activity
operation
function
process
procedure
method
technique
approach
strategy
tactic
plan
scheme
design
blueprint
draft
outline
sketch
drawing
painting
sculpture
art
craft
skill
talent
gift
ability
capacity
capability
potential
promise
prospect
future
destiny
fate
fortune
luck
chance
accident
incident
event
occurrence
happening
episode
occasion
moment
instant
time
period
duration
interval
span
length
distance
space
gap
separation
division
split
break
fracture
crack
hole
opening
entrance
exit
door
gate
portal
passage
corridor
hall
hallway
room
chamber
space
area
zone
region
district
sector
quarter
neighborhood
community
society
population
demographic
generation
age
youth
adult
senior
elderly
child
infant
baby
toddler
teenager
adolescent
student
pupil
scholar
academic
professor
teacher
instructor
educator
trainer
coach
mentor
guide
leader
manager
director
executive
administrator
official
officer
agent
representative
delegate
ambassador
diplomat
politician
lawmaker
legislator
senator
congressman
governor
mayor
president
minister
secretary
chief
head
chairman
chairwoman
chairperson
member
participant
contributor
supporter
advocate
opponent
critic
observer
witness
spectator
audience
crowd
mob
throng
multitude
mass
majority
minority
fraction
segment
portion
share
part
piece
bit
fragment
particle
grain
drop
trace
hint
touch
dash
pinch
amount
quantity
volume
capacity
measure
unit
degree
level
grade
rank
position
place
spot
location
site
point
station
post
base
foundation
ground
basis
principle
rule
law
regulation
policy
guideline
standard
norm
convention
custom
tradition
practice
habit
routine
pattern
rhythm
cycle
sequence
series
chain
string
line
row
column
file
queue
list
array
matrix
table
grid
network
web
mesh
fabric
texture
surface
layer
coat
covering
wrapper
package
container
box
case
bag
sack
pouch
pocket
bottle
jar
can
tin
tube
pipe
hose
cable
wire
cord
rope
string
thread
fiber
strand
hair
fur
feather
scale
skin
hide
leather
cloth
fabric
textile
material
paper
cardboard
wood
timber
lumber
plank
board
panel
sheet
plate
film
membrane
tissue
cell
organ
system
body
organism
creature
being
entity
individual
person
human
animal
plant
tree
flower
grass
leaf
branch
trunk
root
seed
fruit
vegetable
grain
crop
harvest
farm
field
garden
park
forest
wood
jungle
desert
mountain
hill
valley
plain
plateau
coast
shore
beach
island
peninsula
continent
ocean
sea
lake
river
stream
creek
brook
pond
pool
water
liquid
fluid
flow
current
wave
tide
surf
spray
mist
fog
cloud
rain
snow
hail
sleet
ice
frost
dew
vapor
steam
smoke
gas
air
wind
breeze
gust
storm
tempest
hurricane
typhoon
cyclone
tornado
twister
thunder
lightning
bolt
flash
spark
flame
fire
blaze
inferno
heat
warmth
temperature
degree
level
intensity
strength
force
pressure
tension
stress
strain
load
burden
weight
mass
density
volume
capacity
space
room
area
surface
dimension
length
width
height
depth
thickness
diameter
radius
circumference
perimeter
edge
border
boundary
limit
margin
frame
outline
contour
profile
silhouette
shadow
shade
darkness
light
brightness
glow
shine
gleam
glimmer
sparkle
twinkle
flash
glare
beam
ray
radiation
energy
power
electricity
current
voltage
resistance
circuit
switch
button
lever
handle
knob
dial
gauge
meter
indicator
display
screen
monitor
television
radio
telephone
phone
mobile
cell
device
gadget
appliance
tool
instrument
equipment
machinery
apparatus
mechanism
engine
motor
generator
turbine
pump
compressor
valve
piston
cylinder
gear
wheel
axle
shaft
bearing
joint
hinge
spring
bolt
nut
screw
nail
pin
rivet
clip
clamp
fastener
connector
adapter
coupling
fitting
socket
plug
outlet
terminal
contact
connection
interface
port
slot
bay
drive
disk
disc
tape
cartridge
cassette
reel
spool
coil
loop
ring
band
strap
belt
chain
link
hook
clasp
buckle
button
zipper
snap
latch
lock
key
combination
code
password
cipher
encryption
security
protection
safety
shield
guard
barrier
fence
wall
gate
door
window
shutter
blind
curtain
drape
screen
filter
mask
cover
lid
cap
top
cork
stopper
seal
gasket
washer
spacer
shim
pad
cushion
pillow
mattress
bed
cot
couch
sofa
chair
seat
bench
stool
table
desk
counter
shelf
rack
stand
cabinet
cupboard
closet
wardrobe
drawer
chest
trunk
box
crate
carton
package
parcel
bundle
bale
roll
coil
reel
spool
ball
sphere
globe
orb
circle
disk
ring
hoop
loop
oval
ellipse
curve
arc
angle
corner
point
vertex
apex
peak
summit
top
crest
ridge
edge
line
axis
diagonal
radius
diameter
chord
tangent
secant
segment
section
sector
quadrant
hemisphere
zone
band
strip
stripe
layer
tier
level
floor
story
stage
platform
deck
balcony
terrace
patio
porch
veranda
lobby
foyer
entrance
hall
corridor
passage
aisle
walkway
path
trail
track
road
street
avenue
boulevard
lane
alley
highway
freeway
expressway
turnpike
parkway
drive
way
route
course
direction
bearing
heading
orientation
alignment
position
location
place
spot
site
point
station
stop
terminal
depot
port
harbor
dock
wharf
pier
jetty
quay
marina
airport
runway
hangar
garage
parking
lot
field
yard
court
plaza
square
circle
green
common
park
garden
playground
stadium
arena
theater
auditorium
hall
room
chamber
salon
gallery
museum
exhibition
library
archive
vault
treasury
bank
exchange
market
store
shop
boutique
mall
center
complex
facility
installation
plant
factory
mill
workshop
studio
office
bureau
agency
department
division
section
unit
branch
subsidiary
affiliate
headquarters
base
camp
fort
castle
palace
mansion
villa
cottage
cabin
hut
shack
tent
shelter
refuge
haven
sanctuary
temple
shrine
church
cathedral
chapel
mosque
synagogue
monastery
convent
abbey
mission
station
post
outpost
settlement
colony
village
town
city
metropolis
capital
state
nation
country
kingdom
empire
republic
democracy
government
administration
authority
power
regime
rule
reign
dynasty
monarchy
aristocracy
oligarchy
plutocracy
theocracy
dictatorship
tyranny
despotism
autocracy
totalitarianism
fascism
communism
socialism
capitalism
liberalism
conservatism
radicalism
extremism
fundamentalism
nationalism
patriotism
imperialism
colonialism
globalization
internationalism
isolationism
neutrality
alliance
coalition
union
federation
confederation
league
association
organization
institution
establishment
foundation
society
club
guild
order
fraternity
sorority
brotherhood
sisterhood
fellowship
partnership
collaboration
cooperation
coordination
integration
unification
merger
consolidation
amalgamation
combination
mixture
blend
fusion
synthesis
composition
compound
alloy
hybrid
crossbreed
mongrel
mutt
breed
species
genus
family
order
class
phylum
kingdom
domain
taxonomy
classification
categorization
grouping
sorting
arrangement
organization
structure
hierarchy
ladder
scale
spectrum
range
continuum
gradient
progression
sequence
series
succession
chain
cycle
rotation
revolution
orbit
circuit
loop
round
turn
twist
bend
curve
spiral
helix
coil
spring
wave
oscillation
vibration
fluctuation
variation
change
shift
transition
transformation
conversion
mutation
evolution
development
growth
maturation
aging
decay
decline
deterioration
degradation
erosion
corrosion
rust
wear
tear
damage
harm
injury
wound
cut
bruise
scratch
scar
mark
stain
spot
blemish
flaw
defect
imperfection
fault
error
mistake
blunder
slip
lapse
oversight
omission
neglect
carelessness
negligence
recklessness
irresponsibility
misconduct
misbehavior
wrongdoing
offense
crime
violation
infringement
breach
transgression
trespass
sin
vice
evil
wickedness
corruption
depravity
immorality
injustice
unfairness
inequality
discrimination
prejudice
bias
favoritism
nepotism
cronyism
corruption
bribery
fraud
deception
deceit
dishonesty
lying
cheating
stealing
theft
robbery
burglary
larceny
embezzlement
forgery
counterfeiting
smuggling
trafficking
piracy
hijacking
kidnapping
abduction
hostage
ransom
extortion
blackmail
intimidation
harassment
bullying
abuse
violence
aggression
assault
battery
attack
rape
murder
homicide
manslaughter
killing
assassination
execution
lynching
genocide
massacre
slaughter
carnage
bloodshed
war
warfare
combat
battle
fight
conflict
clash
skirmish
engagement
encounter
confrontation
showdown
duel
contest
match
competition
rivalry
race
chase
pursuit
hunt
search
quest
expedition
journey
trip
voyage
tour
excursion
outing
picnic
hike
walk
stroll
march
parade
procession
cavalcade
caravan
convoy
train
railroad
railway
track
line
route
subway
metro
underground
tube
tunnel
bridge
viaduct
overpass
underpass
crossing
intersection
junction
fork
exit
ramp
interchange
roundabout
circle
square
plaza
park
green
lawn
grass
turf
sod
field
meadow
pasture
prairie
plain
steppe
savanna
tundra
taiga
forest
woodland
jungle
rainforest
swamp
marsh
bog
fen
wetland
delta
estuary
bay
gulf
strait
channel
sound
fjord
inlet
cove
lagoon
reef
atoll
shoal
sandbar
dune
cliff
bluff
precipice
escarpment
gorge
canyon
ravine
gully
valley
glen
dale
hollow
basin
depression
crater
caldera
volcano
mountain
peak
summit
pinnacle
crest
ridge
range
chain
massif
plateau
tableland
mesa
butte
hill
knoll
mound
hummock
dune
slope
incline
grade
gradient
pitch
angle
elevation
altitude
height
depth
abyss
chasm
pit
hole
cave
cavern
grotto
den
lair
burrow
tunnel
shaft
mine
quarry
excavation
dig
trench
ditch
moat
channel
canal
aqueduct
conduit
pipeline
sewer
drain
gutter
culvert
flume
chute
spillway
dam
dike
levee
embankment
seawall
breakwater
jetty
groyne
pier
wharf
dock
quay
berth
slip
mooring
anchorage
harbor
port
haven
marina
boatyard
shipyard
dockyard
arsenal
armory
barracks
garrison
fortress
citadel
stronghold
bastion
rampart
parapet
battlement
turret
tower
minaret
spire
steeple
belfry
dome
cupola
vault
arch
arcade
colonnade
portico
porch
stoop
landing
stairs
staircase
stairway
steps
ladder
rung
escalator
elevator
lift
hoist
crane
derrick
winch
pulley
tackle
rigging
rope
cable
chain
hawser
line
cord
string
twine
yarn
thread
fiber
filament
wire
conductor
semiconductor
insulator
resistor
capacitor
inductor
transistor
diode
chip
microchip
processor
CPU
GPU
memory
RAM
ROM
storage
hard
drive
disk
SSD
flash
card
chip
circuit
board
motherboard
mainboard
adapter
card
expansion
slot
bus
interface
port
USB
serial
parallel
ethernet
wireless
WiFi
Bluetooth
network
internet
web
site
website
page
homepage
portal
blog
forum
chat
email
message
text
SMS
notification
alert
reminder
calendar
schedule
agenda
appointment
meeting
conference
seminar
workshop
symposium
congress
convention
assembly
gathering
rally
demonstration
protest
march
strike
boycott
campaign
movement
revolution
rebellion
uprising
revolt
insurrection
mutiny
coup
takeover
overthrow
regime
change
reform
improvement
amendment
revision
update
upgrade
enhancement
optimization
refinement
perfection
ideal
standard
model
example
paradigm
archetype
prototype
template
pattern
blueprint
plan
schema
framework
structure
architecture
design
layout
configuration
setup
installation
implementation
deployment
execution
operation
function
performance
efficiency
effectiveness
productivity
output
yield
throughput
capacity
bandwidth
latency
delay
lag
response
time
speed
rate
frequency
period
cycle
interval
duration
span
length
extent
scope
range
scale
magnitude
size
dimension
proportion
ratio
percentage
fraction
decimal
integer
number
digit
figure
numeral
symbol
character
letter
alphabet
script
writing
text
document
manuscript
scroll
codex
book
volume
tome
publication
edition
issue
copy
print
impression
pressing
run
batch
lot
set
series
collection
anthology
compilation
compendium
encyclopedia
dictionary
lexicon
glossary
thesaurus
index
catalog
directory
register
list
inventory
record
log
journal
diary
notebook
ledger
account
statement
report
summary
abstract
synopsis
outline
overview
review
critique
commentary
analysis
interpretation
explanation
description
definition
specification
instruction
manual
guide
handbook
textbook
primer
tutorial
lesson
course
curriculum
syllabus
program
schedule
timetable
agenda
itinerary
plan
roadmap
blueprint
strategy
tactics
approach
method
methodology
technique
procedure
protocol
algorithm
formula
equation
expression
function
operation
calculation
computation
mathematics
arithmetic
algebra
geometry
trigonometry
calculus
statistics
probability
logic
reasoning
inference
deduction
induction
abduction
hypothesis
theorem
axiom
postulate
lemma
corollary
proof
demonstration
verification
validation
confirmation
certification
accreditation
authorization
approval
endorsement
ratification
sanction
permission
consent
agreement
acceptance
acknowledgment
recognition
admission
confession
declaration
statement
assertion
claim
allegation
accusation
charge
indictment
prosecution
trial
hearing
case
lawsuit
litigation
dispute
controversy
argument
debate
discussion
dialogue
conversation
talk
speech
address
lecture
presentation
sermon
homily
discourse
oration
recitation
narration
storytelling
tale
story
narrative
account
chronicle
history
biography
autobiography
memoir
diary
journal
log
record
documentation
evidence
testimony
witness
deposition
affidavit
oath
vow
pledge
promise
commitment
guarantee
warranty
assurance
insurance
coverage
policy
contract
agreement
treaty
pact
accord
convention
protocol
charter
constitution
statute
law
ordinance
regulation
rule
code
act
bill
legislation
measure
provision
clause
article
section
paragraph
sentence
phrase
clause
word
term
expression
idiom
saying
proverb
maxim
adage
aphorism
epigram
motto
slogan
catchphrase
tagline
headline
title
caption
subtitle
heading
subheading
label
tag
mark
stamp
seal
signature
autograph
initial
monogram
logo
emblem
badge
insignia
crest
coat
arms
flag
banner
pennant
standard
ensign
colors
symbol
icon
image
picture
illustration
diagram
chart
graph
plot
map
atlas
globe
projection
scale
legend
key
compass
direction
bearing
orientation
navigation
guidance
steering
control
management
administration
supervision
oversight
inspection
monitoring
surveillance
observation
scrutiny
examination
investigation
inquiry
inquest
probe
exploration
search
hunt
quest
pursuit
chase
tracking
tracing
detection
discovery
finding
result
outcome
conclusion
determination
resolution
settlement
solution
answer
response
reply
reaction
feedback
input
output
data
information
intelligence
knowledge
wisdom
insight
understanding
comprehension
perception
awareness
consciousness
cognition
recognition
identification
classification
categorization
organization
arrangement
structure
system
framework
model
theory
hypothesis
conjecture
speculation
guess
estimate
approximation
calculation
measurement
assessment
evaluation
appraisal
judgment
opinion
view
perspective
standpoint
position
stance
attitude
disposition
inclination
tendency
propensity
predisposition
bias
prejudice
preference
choice
selection
option
alternative
possibility
opportunity
chance
probability
likelihood
risk
hazard
danger
threat
menace
peril
jeopardy
vulnerability
exposure
susceptibility
immunity
resistance
defense
protection
safeguard
precaution
measure
step
action
initiative
intervention
interference
meddling
intrusion
invasion
incursion
raid
attack
assault
offensive
strike
blow
hit
punch
kick
slap
smack
whack
thump
bang
crash
collision
impact
shock
jolt
bump
knock
rap
tap
pat
stroke
caress
touch
feel
sensation
feeling
sense
perception
impression
notion
idea
concept
thought
reflection
consideration
contemplation
meditation
pondering
musing
rumination
deliberation
cogitation
speculation
conjecture
surmise
supposition
assumption
presumption
inference
deduction
conclusion
judgment
decision
determination
resolution
choice
selection
preference
option
alternative
route
path
way
course
direction
line
track
trail
road
street
highway
avenue
boulevard
lane
alley
passage
corridor
hallway
gallery
walkway
sidewalk
pavement
footpath
pathway
byway
thoroughfare
artery
vein
channel
conduit
duct
tube
pipe
hose
line
cord
cable
wire
strand
fiber
thread
filament
hair
bristle
whisker
antenna
feeler
tentacle
appendage
limb
arm
leg
wing
fin
tail
claw
talon
nail
hoof
paw
foot
hand
finger
thumb
toe
heel
ankle
wrist
elbow
shoulder
hip
knee
joint
bone
skeleton
skull
cranium
jaw
teeth
tooth
tongue
lip
mouth
nose
nostril
ear
eye
eyebrow
eyelash
eyelid
cheek
chin
forehead
temple
scalp
hair
beard
mustache
sideburns
neck
throat
Adam
apple
collarbone
clavicle
chest
breast
bosom
torso
trunk
abdomen
stomach
belly
navel
waist
hip
buttocks
rear
back
spine
backbone
vertebra
rib
pelvis
groin
genitals
organ
gland
tissue
muscle
tendon
ligament
cartilage
membrane
skin
epidermis
dermis
pore
sweat
perspiration
sebum
oil
grease
fat
adipose
tissue
cell
nucleus
cytoplasm
membrane
organelle
mitochondria
ribosome
chromosome
gene
DNA
RNA
protein
enzyme
hormone
neurotransmitter
receptor
antibody
antigen
pathogen
virus
bacteria
fungus
parasite
microbe
germ
infection
disease
illness
sickness
ailment
malady
disorder
condition
syndrome
symptom
sign
indication
manifestation
expression
presentation
appearance
aspect
feature
characteristic
trait
quality
attribute
property
nature
essence
substance
core
heart
center
middle
nucleus
hub
focal
point
crux
nub
gist
essence
spirit
soul
mind
psyche
consciousness
awareness
sentience
intelligence
intellect
reason
rationality
logic
sense
judgment
wisdom
understanding
knowledge
learning
education
training
instruction
teaching
tutelage
coaching
mentoring
guidance
direction
leadership
management
administration
governance
authority
power
control
influence
sway
clout
leverage
pull
weight
importance
significance
consequence
relevance
pertinence
applicability
utility
usefulness
value
worth
merit
quality
excellence
superiority
preeminence
distinction
eminence
prominence
fame
renown
reputation
prestige
honor
glory
acclaim
recognition
acknowledgment
appreciation
gratitude
thanks
credit
praise
commendation
approval
endorsement
support
backing
sponsorship
patronage
advocacy
championship
promotion
advancement
progress
development
growth
expansion
extension
increase
increment
addition
supplement
complement
enhancement
improvement
upgrade
refinement
optimization
perfection
excellence
quality
standard
benchmark
criterion
measure
metric
indicator
gauge
barometer
thermometer
scale
spectrum
range
gamut
array
variety
diversity
multiplicity
plurality
multitude
abundance
profusion
plethora
wealth
richness
affluence
prosperity
success
achievement
accomplishment
attainment
realization
fulfillment
satisfaction
contentment
happiness
joy
pleasure
delight
enjoyment
gratification
bliss
ecstasy
rapture
euphoria
elation
jubilation
exultation
triumph
victory
conquest
success
win
achievement
feat
exploit
deed
act
action
performance
execution
implementation
realization
actualization
manifestation
expression
demonstration
display
exhibition
show
presentation
representation
depiction
portrayal
illustration
description
account
narrative
story
tale
anecdote
episode
incident
occurrence
event
happening
circumstance
situation
case
instance
example
specimen
sample
model
prototype
archetype
paradigm
pattern
template
standard
norm
average
mean
median
mode
typical
usual
normal
regular
ordinary
common
conventional
traditional
customary
habitual
routine
standard
stock
generic
universal
general
broad
wide
extensive
comprehensive
inclusive
complete
total
entire
whole
full
thorough
exhaustive
detailed
elaborate
intricate
complex
complicated
sophisticated
advanced
developed
mature
refined
polished
perfect
flawless
impeccable
immaculate
pristine
pure
clean
clear
transparent
obvious
evident
apparent
manifest
plain
distinct
clear
definite
certain
sure
positive
confident
assured
convinced
persuaded
satisfied
content
happy
pleased
glad
delighted
thrilled
excited
enthusiastic
eager
keen
interested
curious
inquisitive
inquiring
questioning
wondering
puzzled
perplexed
confused
bewildered
baffled
mystified
stumped
stuck
lost
uncertain
unsure
doubtful
skeptical
suspicious
distrustful
wary
cautious
careful
prudent
judicious
wise
sensible
reasonable
rational
logical
sound
valid
legitimate
justified
warranted
authorized
approved
sanctioned
permitted
allowed
acceptable
admissible
eligible
qualified
suitable
appropriate
fitting
proper
correct
right
accurate
precise
exact
perfect
ideal
optimal
best
finest
supreme
ultimate
maximum
highest
greatest
largest
biggest
major
main
primary
principal
chief
leading
foremost
premier
top
first
number
one
prime
paramount
preeminent
predominant
dominant
prevailing
prevalent
widespread
common
frequent
regular
constant
continual
continuous
perpetual
eternal
everlasting
endless
infinite
limitless
boundless
unlimited
unrestricted
unrestrained
unconstrained
free
independent
autonomous
sovereign
self-governing
democratic
republican
constitutional
legal
lawful
legitimate
authorized
official
formal
ceremonial
ritual
symbolic
representative
typical
characteristic
distinctive
unique
special
particular
specific
individual
personal
private
confidential
secret
classified
restricted
limited
exclusive
selective
discriminating
discerning
critical
analytical
logical
rational
reasonable
sensible
practical
pragmatic
realistic
objective
impartial
unbiased
neutral
fair
just
equitable
balanced
even
equal
uniform
consistent
regular
steady
stable
constant
fixed
static
stationary
immobile
motionless
still
quiet
silent
mute
speechless
voiceless
inarticulate
incoherent
unintelligible
incomprehensible
obscure
vague
ambiguous
equivocal
doubtful
questionable
dubious
uncertain
indefinite
indeterminate
unspecified
unnamed
anonymous
unknown
unfamiliar
strange
odd
peculiar
unusual
uncommon
rare
exceptional
extraordinary
remarkable
notable
noteworthy
significant
important
meaningful
purposeful
intentional
deliberate
conscious
aware
mindful
attentive
observant
vigilant
watchful
alert
awake
conscious
sentient
aware
cognizant
informed
knowledgeable
educated
learned
scholarly
academic
intellectual
cerebral
mental
psychological
emotional
spiritual
moral
ethical
virtuous
righteous
good
decent
honest
truthful
sincere
genuine
authentic
real
actual
true
factual
accurate
correct
right
proper
appropriate
suitable
fitting
apt
relevant
pertinent
applicable
useful
helpful
beneficial
advantageous
favorable
positive
constructive
productive
fruitful
profitable
rewarding
satisfying
fulfilling
gratifying
pleasing
enjoyable
pleasant
agreeable
delightful
charming
attractive
appealing
engaging
interesting
fascinating
intriguing
captivating
enthralling
absorbing
engrossing
compelling
gripping
riveting
exciting
thrilling
exhilarating
stimulating
invigorating
energizing
refreshing
revitalizing
rejuvenating
restorative
healing
therapeutic
medicinal
curative
remedial
corrective
preventive
prophylactic
protective
defensive
safeguarding
preservative
conservative
cautious
careful
prudent
discreet
circumspect
wary
guarded
reserved
restrained
controlled
disciplined
regulated
ordered
organized
systematic
methodical
orderly
neat
tidy
clean
immaculate
spotless
pristine
pure
uncontaminated
unpolluted
unspoiled
untainted
untouched
virgin
original
pristine
fresh
new
novel
innovative
creative
imaginative
inventive
original
unique
distinctive
characteristic
typical
representative
symbolic
emblematic
indicative
suggestive
evocative
reminiscent
nostalgic
sentimental
emotional
passionate
intense
fervent
ardent
zealous
enthusiastic
eager
keen
avid
devoted
dedicated
committed
loyal
faithful
true
steadfast
constant
unwavering
resolute
determined
firm
strong
robust
sturdy
solid
stable
secure
safe
protected
sheltered
shielded
guarded
defended
fortified
reinforced
strengthened
enhanced
improved
upgraded
advanced
developed
evolved
progressed
grown
expanded
extended
enlarged
increased
amplified
magnified
intensified
heightened
elevated
raised
lifted
hoisted
boosted
promoted
advanced
forwarded
propelled
driven
pushed
pressed
urged
encouraged
motivated
inspired
stimulated
excited
aroused
awakened
stirred
moved
touched
affected
influenced
impressed
impacted
changed
altered
modified
adjusted
adapted
transformed
converted
translated
interpreted
explained
clarified
elucidated
illuminated
enlightened
informed
educated
taught
trained
instructed
coached
mentored
guided
directed
led
managed
supervised
overseen
monitored
watched
observed
noticed
perceived
detected
discovered
found
located
identified
recognized
acknowledged
accepted
approved
endorsed
supported
backed
sponsored
funded
financed
invested
contributed
donated
gave
provided
supplied
furnished
equipped
outfitted
prepared
readied
primed
set
arranged
organized
planned
scheduled
programmed
designed
created
made
produced
manufactured
fabricated
constructed
built
erected
assembled
installed
mounted
fixed
attached
connected
joined
linked
coupled
united
combined
merged
integrated
consolidated
amalgamated
blended
mixed
fused
synthesized
composed
formulated
devised
invented
conceived
imagined
envisioned
visualized
pictured
depicted
portrayed
represented
illustrated
demonstrated
showed
displayed
exhibited
presented
introduced
launched
initiated
started
began
commenced
opened
inaugurated
founded
established
instituted
created
formed
organized
structured
arranged
configured
set
adjusted
tuned
calibrated
balanced
aligned
synchronized
coordinated
harmonized
integrated
unified
consolidated
centralized
concentrated
focused
directed
aimed
targeted
oriented
positioned
placed
located
situated
stationed
posted
deployed
distributed
dispersed
scattered
spread
diffused
disseminated
broadcast
transmitted
communicated
conveyed
expressed
articulated
stated
declared
announced
proclaimed
published
released
issued
circulated
distributed
delivered
sent
dispatched
forwarded
transmitted
transferred
moved
transported
carried
conveyed
hauled
shipped
freight
cargo
load
burden
weight
mass
bulk
volume
quantity
amount
number
total
sum
aggregate
collection
accumulation
assemblage
gathering
cluster
group
batch
lot
set
series
sequence
string
chain
train
file
line
row
column
array
matrix
grid
network
system
complex
structure
framework
organization
institution
establishment
enterprise
venture
undertaking
project
program
initiative
campaign
drive
effort
endeavor
attempt
try
trial
test
experiment
investigation
examination
inspection
analysis
assessment
evaluation
appraisal
review
survey
study
research
inquiry
exploration
probe
search
hunt
quest
pursuit
mission
objective
goal
aim
target
purpose
intention
plan
strategy
scheme
design
plot
blueprint
roadmap
pathway
route
course
trajectory
direction
heading
bearing
orientation
alignment
configuration
arrangement
layout
setup
format
structure
organization
composition
makeup
constitution
formation
construction
architecture
design
style
fashion
manner
mode
method
technique
procedure
process
approach
system
mechanism
device
tool
instrument
implement
utensil
apparatus
equipment
machinery
hardware
software
firmware
program
application
app
system
platform
interface
portal
gateway
access
entry
entrance
admission
ingress
egress
exit
outlet
opening
aperture
hole
gap
space
void
vacuum
emptiness
nothingness
absence
lack
deficiency
shortage
scarcity
dearth
paucity
insufficiency
inadequacy
want
need
requirement
necessity
essential
prerequisite
condition
provision
stipulation
qualification
restriction
limitation
constraint
restraint
inhibition
prohibition
ban
embargo
sanction
penalty
punishment
sentence
fine
fee
charge
cost
expense
price
rate
tariff
toll
tax
duty
levy
impost
assessment
evaluation
appraisal
estimation
calculation
computation
reckoning
accounting
audit
examination
inspection
review
check
verification
validation
confirmation
certification
authentication
authorization
approval
endorsement
ratification
adoption
acceptance
agreement
consent
permission
license
permit
warrant
authority
power
right
privilege
entitlement
claim
title
ownership
possession
custody
care
charge
responsibility
duty
obligation
commitment
pledge
promise
vow
oath
guarantee
warranty
assurance
insurance
security
collateral
deposit
bond
surety
bail
ransom
redemption
salvation
deliverance
rescue
recovery
retrieval
reclamation
restoration
rehabilitation
reconstruction
rebuilding
renewal
renovation
refurbishment
remodeling
makeover
transformation
metamorphosis
conversion
transition
shift
change
alteration
modification
adjustment
adaptation
accommodation
compromise
settlement
resolution
solution
answer
key
clue
hint
tip
pointer
indicator
sign
signal
marker
beacon
landmark
milestone
turning
point
watershed
threshold
boundary
limit
edge
border
frontier
perimeter
circumference
outline
contour
profile
silhouette
shape
form
figure
configuration
pattern
design
motif
theme
subject
topic
matter
issue
question
problem
challenge
difficulty
obstacle
hurdle
barrier
impediment
hindrance
obstruction
blockage
bottleneck
constraint
limitation
restriction
regulation
rule
law
statute
ordinance
decree
edict
proclamation
declaration
announcement
notice
notification
alert
warning
caution
advisory
bulletin
communique
dispatch
message
communication
correspondence
letter
note
memo
memorandum
circular
flyer
pamphlet
brochure
leaflet
booklet
manual
guide
handbook
directory
catalog
prospectus
syllabus
curriculum
program
schedule
agenda
calendar
timetable
itinerary
plan
blueprint
diagram
chart
map
layout
scheme
design
draft
sketch
outline
framework
structure
model
prototype
mockup
template
pattern
mold
cast
form
shape
figure
sculpture
statue
monument
memorial
tribute
homage
honor
recognition
acknowledgment
appreciation
gratitude
thanks
praise
acclaim
applause
ovation
cheer
celebration
festivity
festival
party
gathering
assembly
meeting
conference
convention
congress
symposium
colloquium
seminar
workshop
training
session
class
lesson
lecture
presentation
talk
speech
address
sermon
homily
discourse
oration
recital
performance
show
display
exhibition
demonstration
preview
screening
viewing
inspection
tour
visit
trip
excursion
outing
jaunt
journey
voyage
cruise
sail
flight
ride
drive
walk
hike
trek
march
parade
procession
cortege
cavalcade
motorcade
caravan
convoy
fleet
armada
squadron
formation
unit
team
crew
staff
personnel
workforce
labor
workers
employees
associates
colleagues
partners
collaborators
contributors
participants
members
constituents
stakeholders
shareholders
investors
backers
supporters
sponsors
patrons
benefactors
donors
contributors
philanthropists
humanitarians
activists
advocates
champions
defenders
protectors
guardians
custodians
keepers
caretakers
stewards
trustees
executors
administrators
managers
directors
executives
officers
officials
authorities
representatives
delegates
ambassadors
envoys
emissaries
messengers
couriers
carriers
bearers
porters
handlers
operators
technicians
specialists
experts
professionals
practitioners
consultants
advisors
counselors
mentors
coaches
trainers
instructors
teachers
educators
professors
lecturers
tutors
guides
leaders
chiefs
heads
captains
commanders
generals
admirals
colonels
majors
lieutenants
sergeants
corporals
privates
soldiers
troops
forces
army
navy
air
force
marines
militia
guard
police
constabulary
gendarmerie
patrol
squad
unit
team
crew
gang
band
group
party
company
battalion
regiment
brigade
division
corps
command
headquarters
base
camp
station
post
fort
garrison
barracks
quarters
accommodations
lodging
housing
shelter
residence
dwelling
home
house
apartment
flat
condominium
condo
townhouse
duplex
triplex
bungalow
cottage
cabin
chalet
villa
mansion
estate
manor
palace
castle
fortress
citadel
keep
tower
dungeon
vault
cellar
basement
foundation
footing
groundwork
basis
base
support
pillar
column
post
beam
girder
joist
rafter
truss
frame
skeleton
structure
building
edifice
construction
facility
complex
compound
development
project
scheme
plan
proposal
proposition
suggestion
recommendation
advice
counsel
guidance
direction
instruction
order
command
directive
mandate
injunction
decree
ordinance
regulation
rule
law
statute
act
legislation
bill
measure
provision
clause
article
section
subsection
paragraph
subparagraph
sentence
phrase
clause
word
term
expression
locution
idiom
colloquialism
slang
jargon
cant
argot
dialect
vernacular
language
tongue
speech
discourse
communication
conversation
dialogue
discussion
debate
argument
dispute
disagreement
difference
divergence
discrepancy
inconsistency
contradiction
paradox
anomaly
aberration
deviation
variation
fluctuation
oscillation
vibration
pulsation
beat
rhythm
tempo
pace
speed
velocity
rate
frequency
pitch
tone
timbre
quality
character
nature
disposition
temperament
personality
individuality
identity
self
ego
psyche
mind
consciousness
awareness
perception
sensation
feeling
emotion
sentiment
passion
affection
love
fondness
liking
preference
inclination
tendency
propensity
proclivity
predilection
predisposition
bias
prejudice
partiality
favoritism
discrimination
distinction
differentiation
separation
division
partition
segmentation
fragmentation
splitting
breaking
fracture
rupture
breach
crack
fissure
crevice
gap
opening
hole
aperture
orifice
vent
outlet
drain
sewer
pipe
conduit
channel
passage
corridor
tunnel
shaft
duct
tube
cylinder
barrel
drum
tank
container
vessel
receptacle
holder
case
box
carton
package
wrapper
covering
envelope
jacket
sleeve
sheath
casing
housing
shell
hull
body
frame
chassis
structure
skeleton
framework
scaffolding
support
prop
brace
strut
buttress
reinforcement
strengthening
fortification
defense
protection
safeguard
shield
guard
barrier
wall
fence
hedge
screen
curtain
veil
mask
disguise
camouflage
concealment
cover
hiding
secrecy
privacy
confidentiality
discretion
prudence
caution
care
attention
heed
notice
regard
consideration
thought
reflection
contemplation
meditation
pondering
musing
deliberation
rumination
cogitation
speculation
conjecture
supposition
assumption
presumption
hypothesis
theory
thesis
proposition
postulate
axiom
principle
tenet
doctrine
dogma
creed
belief
faith
trust
confidence
reliance
dependence
security
safety
assurance
certainty
conviction
persuasion
opinion
view
outlook
perspective
standpoint
viewpoint
angle
aspect
facet
dimension
element
component
constituent
ingredient
factor
variable
parameter
criterion
standard
measure
metric
gauge
indicator
index
benchmark
reference
touchstone
yardstick
scale
ruler
compass
protractor
divider
caliper
micrometer
vernier
gauge
meter
thermometer
barometer
hygrometer
anemometer
speedometer
odometer
tachometer
chronometer
clock
watch
timer
stopwatch
hourglass
sundial
calendar
almanac
schedule
timetable
agenda
program
itinerary
plan
arrangement
organization
coordination
synchronization
timing
scheduling
planning
preparation
readiness
alertness
vigilance
watchfulness
awareness
consciousness
mindfulness
attention
concentration
focus
intensity
effort
exertion
energy
power
force
strength
might
vigor
vitality
stamina
endurance
persistence
perseverance
determination
resolution
resolve
willpower
tenacity
grit
courage
bravery
valor
heroism
gallantry
fortitude
pluck
spirit
mettle
nerve
boldness
audacity
daring
fearlessness
intrepidity
dauntlessness
confidence
assurance
self-assurance
self-confidence
poise
composure
equanimity
calmness
serenity
tranquility
peace
quiet
stillness
silence
hush
lull
pause
break
interval
intermission
interlude
recess
respite
rest
relaxation
leisure
recreation
entertainment
amusement
diversion
distraction
pastime
hobby
interest
pursuit
activity
occupation
employment
job
work
labor
toil
effort
exertion
endeavor
undertaking
enterprise
venture
project
task
assignment
mission
duty
responsibility
obligation
commitment
charge
trust
mandate
commission
delegation
appointment
designation
nomination
election
selection
choice
decision
determination
conclusion
judgment
verdict
finding
ruling
decree
sentence
pronouncement
declaration
statement
assertion
affirmation
claim
contention
allegation
accusation
charge
complaint
grievance
protest
objection
opposition
resistance
defiance
rebellion
revolt
insurrection
uprising
revolution
coup
overthrow
subversion
sedition
treason
betrayal
treachery
perfidy
disloyalty
infidelity
unfaithfulness
duplicity
deceit
deception
fraud
trickery
cunning
guile
craftiness
slyness
wiliness
artfulness
cleverness
ingenuity
resourcefulness
inventiveness
creativity
imagination
originality
innovation
novelty
freshness
newness
modernity
contemporaneity
currency
relevance
timeliness
appropriateness
suitability
fitness
aptness
propriety
correctness
accuracy
precision
exactness
fidelity
faithfulness
loyalty
devotion
dedication
commitment
allegiance
fealty
homage
respect
reverence
veneration
adoration
worship
idolatry
deification
glorification
exaltation
praise
laudation
commendation
approval
endorsement
sanction
authorization
permission
consent
agreement
acquiescence
compliance
conformity
obedience
submission
subjection
subordination
subservience
servility
slavery
bondage
captivity
imprisonment
incarceration
confinement
detention
custody
restraint
constraint
restriction
limitation
prohibition
ban
embargo
blockade
siege
encirclement
isolation
quarantine
segregation
separation
division
partition
boundary
border
frontier
limit
extent
range
scope
reach
span
compass
ambit
sphere
domain
realm
territory
region
area
zone
sector
district
quarter
neighborhood
locality
vicinity
environs
surroundings
environment
setting
context
background
milieu
atmosphere
ambiance
climate
conditions
circumstances
situation
state
status
position
place
location
site
spot
point
station
post
base
foundation
footing
ground
basis
premise
assumption
presupposition
given
fact
truth
reality
actuality
existence
being
entity
thing
object
item
article
piece
unit
element
