requests
numpy
pandas
flask
django
pillow
sqlalchemy
beautifulsoup4
matplotlib
scikit-learn
requsets
numppy
pandass
falsk
djnago
pilow
sqlalchamy
beatifulsoup4
matplotlb
sckit-learn
urllib3
certifi
setuptools
pip
wheel
pyparsing
python-dateutil
pytz
six
idna
chardet
cryptography
pyyaml
jinja2
click
werkzeug
itsdangerous
markupsafe
blinker
tornado