[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
the
a
an
is
are
was
were
be
been
being
have
has
had
do
does
did
will
would
could
should
can
may
might
must
shall
ought
need
dare
used
going
want
wanted
wants
like
liked
likes
love
loved
loves
hate
hated
hates
see
saw
seen
look
looked
looks
come
came
comes
go
went
goes
take
took
taken
make
made
makes
get
got
gotten
give
gave
given
find
found
finds
think
thought
thinks
know
knew
known
feel
felt
feels
become
became
becomes
leave
left
leaves
put
puts
bring
brought
brings
begin
began
begun
keep
kept
keeps
hold
held
holds
write
wrote
written
stand
stood
stands
hear
heard
hears
let
lets
mean
meant
means
set
sets
run
ran
runs
pay
paid
pays
sit
sat
sits
meet
met
meets
include
included
includes
continue
continued
continues
learn
learned
learns
change
changed
changes
lead
led
leads
understand
understood
understands
watch
watched
watches
follow
followed
follows
stop
stopped
stops
create
created
creates
speak
spoke
spoken
read
reads
allow
allowed
allows
add
added
adds
spend
spent
spends
grow
grew
grown
open
opened
opens
walk
walked
walks
win
won
wins
offer
offered
offers
remember
remembered
remembers
consider
considered
considers
appear
appeared
appears
buy
bought
buys
wait
waited
waits
serve
served
serves
die
died
dies
send
sent
sends
expect
expected
expects
build
built
builds
stay
stayed
stays
fall
fell
fallen
cut
cuts
reach
reached
reaches
kill
killed
kills
remain
remained
remains
suggest
suggested
suggests
raise
raised
raises
pass
passed
passes
sell
sold
sells
require
required
requires
report
reported
reports
decide
decided
decides
pull
pulled
pulls
i
you
he
she
it
we
they
me
him
her
us
them
my
your
his
its
our
their
mine
yours
hers
ours
theirs
this
that
these
those
who
what
where
when
why
how
which
whose
whom
all
some
any
many
much
few
several
both
each
every
either
neither
other
another
such
same
own
one
two
three
four
five
six
seven
eight
nine
ten
eleven
twelve
thirteen
fourteen
fifteen
sixteen
seventeen
eighteen
nineteen
twenty
thirty
forty
fifty
sixty
seventy
eighty
ninety
hundred
thousand
million
billion
first
second
third
fourth
fifth
last
next
previous
new
old
good
bad
great
small
large
big
little
long
short
high
low
early
late
young
important
public
able
free
available
likely
clear
sure
certain
possible
true
false
real
full
ready
simple
easy
hard
difficult
strong
weak
hot
cold
warm
cool
dark
light
heavy
clean
dirty
safe
dangerous
right
wrong
left
correct
similar
different
same
particular
certain
main
only
single
general
common
special
specific
recent
late
human
social
political
economic
financial
national
international
local
federal
central
medical
legal
environmental
cultural
natural
physical
mental
historical
military
industrial
commercial
professional
personal
private
individual
collective
total
whole
entire
complete
full
half
quarter
part
section
area
region
place
location
site
position
point
level
degree
rate
amount
number
figure
value
price
cost
quality
standard
type
kind
sort
form
way
method
system
process
structure
organization
institution
company
business
industry
market
economy
government
state
country
nation
world
society
community
group
team
family
member
person
people
man
woman
child
boy
girl
student
teacher
worker
employee
manager
director
president
leader
official
officer
minister
senator
representative
doctor
nurse
lawyer
engineer
scientist
researcher
professor
artist
writer
author
actor
player
athlete
customer
client
user
consumer
citizen
resident
neighbor
friend
colleague
partner
associate
competitor
opponent
enemy
stranger
guest
visitor
tourist
passenger
driver
pilot
captain
soldier
police
guard
agent
representative
spokesman
spokesperson
chairman
chief
head
boss
supervisor
administrator
coordinator
consultant
advisor
expert
specialist
analyst
designer
developer
programmer
technician
operator
assistant
secretary
clerk
receptionist
attendant
server
waiter
cook
chef
farmer
builder
contractor
mechanic
electrician
plumber
carpenter
painter
cleaner
gardener
driver
carrier
dealer
seller
buyer
trader
investor
banker
accountant
auditor
inspector
examiner
judge
jury
witness
victim
suspect
defendant
plaintiff
prosecutor
attorney
counsel
advocate
guardian
trustee
executor
beneficiary
donor
volunteer
participant
candidate
applicant
nominee
winner
loser
champion
hero
star
celebrity
personality
character
figure
model
example
instance
case
issue
problem
question
matter
subject
topic
theme
idea
concept
theory
principle
rule
law
regulation
policy
plan
program
project
scheme
initiative
proposal
suggestion
recommendation
advice
guidance
instruction
direction
order
command
request
demand
requirement
condition
term
provision
clause
article
section
paragraph
sentence
phrase
word
letter
symbol
sign
mark
label
tag
title
name
term
expression
description
definition
explanation
interpretation
translation
version
edition
copy
original
draft
document
file
record
report
statement
account
summary
review
analysis
study
research
survey
investigation
examination
test
trial
experiment
demonstration
presentation
display
exhibition
show
performance
event
occasion
ceremony
celebration
festival
conference
meeting
session
discussion
debate
conversation
dialogue
talk
speech
address
lecture
lesson
class
course
training
education
instruction
teaching
learning
knowledge
information
data
fact
detail
feature
aspect
element
factor
component
part
piece
item
unit
object
thing
material
substance
matter
product
goods
article
commodity
resource
asset
property
possession
belonging
equipment
tool
instrument
device
machine
apparatus
mechanism
system
network
infrastructure
facility
plant
factory
workshop
office
store
shop
market
mall
center
station
terminal
port
airport
railway
road
street
avenue
highway
bridge
tunnel
building
structure
house
home
apartment
flat
room
hall
chamber
space
area
zone
district
neighborhood
village
town
city
capital
province
state
region
territory
land
ground
soil
earth
world
globe
planet
moon
sun
star
sky
heaven
cloud
air
wind
storm
rain
snow
ice
water
sea
ocean
river
lake
stream
mountain
hill
valley
plain
desert
forest
wood
tree
plant
flower
grass
crop
field
farm
garden
park
beach
coast
shore
island
continent
country
nation
border
boundary
edge
side
surface
top
bottom
front
back
inside
outside
interior
exterior
center
middle
end
beginning
start
finish
origin
source
base
foundation
ground
basis
reason
cause
effect
result
consequence
outcome
impact
influence
force
power
energy
strength
capacity
ability
skill
talent
gift
quality
attribute
characteristic
feature
property
nature
essence
substance
core
heart
soul
spirit
mind
brain
body
head
face
eye
ear
nose
mouth
tooth
tongue
lip
cheek
chin
neck
shoulder
arm
hand
finger
thumb
leg
foot
toe
knee
back
chest
stomach
heart
lung
liver
kidney
bone
muscle
skin
blood
cell
tissue
organ
nerve
sense
feeling
emotion
mood
attitude
opinion
view
belief
faith
trust
hope
fear
worry
concern
interest
desire
wish
need
want
demand
preference
choice
option
alternative
possibility
chance
opportunity
risk
threat
danger
safety
security
protection
defense
attack
war
peace
conflict
fight
battle
struggle
competition
contest
game
match
race
sport
play
fun
entertainment
pleasure
enjoyment
happiness
joy
delight
satisfaction
comfort
relief
pain
suffering
trouble
difficulty
hardship
challenge
obstacle
barrier
limit
restriction
constraint
control
regulation
management
administration
operation
function
activity
action
movement
motion
change
development
growth
progress
improvement
advance
increase
rise
gain
addition
reduction
decrease
decline
fall
loss
damage
harm
injury
wound
disease
illness
sickness
health
fitness
wellness
care
treatment
therapy
medicine
drug
pill
dose
surgery
operation
procedure
examination
diagnosis
symptom
condition
disorder
syndrome
infection
virus
bacteria
cancer
diabetes
pressure
temperature
fever
cough
cold
flu
headache
pain
ache
stress
anxiety
depression
disorder
addiction
abuse
violence
crime
theft
robbery
murder
assault
rape
fraud
corruption
bribery
scandal
controversy
dispute
argument
disagreement
conflict
tension
crisis
emergency
disaster
accident
incident
event
situation
circumstance
condition
state
status
position
rank
grade
level
stage
phase
period
time
moment
instant
second
minute
hour
day
week
month
year
decade
century
era
age
generation
lifetime
birth
life
death
funeral
marriage
wedding
divorce
relationship
connection
link
tie
bond
association
partnership
alliance
union
league
club
society
association
organization
institution
foundation
agency
bureau
department
division
branch
unit
team
crew
staff
personnel
workforce
labor
work
job
employment
career
profession
occupation
trade
craft
business
enterprise
venture
operation
activity
task
duty
responsibility
role
function
purpose
goal
objective
target
aim
mission
vision
strategy
plan
policy
approach
method
technique
procedure
process
practice
custom
tradition
habit
routine
pattern
trend
fashion
style
manner
mode
form
type
kind
sort
class
category
group
set
series
sequence
order
arrangement
organization
structure
framework
system
model
design
format
layout
scheme
pattern
template
standard
norm
rule
principle
guideline
criterion
measure
scale
index
indicator
sign
signal
clue
hint
evidence
proof
confirmation
verification
validation
certification
approval
permission
consent
agreement
contract
deal
arrangement
settlement
resolution
solution
answer
response
reply
reaction
feedback
comment
remark
observation
note
notice
announcement
declaration
statement
claim
assertion
allegation
accusation
charge
complaint
criticism
objection
protest
opposition
resistance
rejection
refusal
denial
contradiction
challenge
question
inquiry
query
request
appeal
petition
application
submission
proposal
bid
offer
tender
quote
estimate
forecast
prediction
projection
expectation
assumption
hypothesis
speculation
guess
thought
idea
notion
conception
impression
perception
understanding
interpretation
meaning
sense
significance
importance
value
worth
merit
benefit
advantage
profit
gain
return
reward
prize
award
honor
recognition
acknowledgment
appreciation
gratitude
thanks
praise
compliment
tribute
credit
blame
fault
guilt
responsibility
liability
obligation
duty
commitment
promise
pledge
vow
oath
guarantee
warranty
assurance
insurance
coverage
protection
security
safety
defense
shelter
refuge
asylum
sanctuary
haven
retreat
escape
exit
way
route
path
road
journey
trip
travel
tour
voyage
expedition
adventure
experience
encounter
meeting
visit
stay
stop
pause
break
rest
sleep
dream
nightmare
vision
image
picture
photo
photograph
portrait
drawing
painting
sketch
illustration
diagram
chart
graph
map
plan
blueprint
design
model
pattern
sample
example
specimen
copy
replica
duplicate
version
variant
alternative
substitute
replacement
backup
reserve
spare
extra
additional
supplementary
complementary
auxiliary
secondary
minor
major
primary
main
chief
principal
leading
dominant
superior
inferior
senior
junior
elder
younger
former
latter
previous
next
following
subsequent
final
ultimate
eventual
original
initial
preliminary
temporary
permanent
constant
continuous
regular
frequent
occasional
rare
common
usual
normal
typical
standard
average
ordinary
regular
special
exceptional
extraordinary
unusual
unique
rare
distinct
distinctive
characteristic
typical
representative
symbolic
significant
meaningful
important
essential
vital
critical
crucial
key
fundamental
basic
elementary
primary
advanced
complex
complicated
difficult
challenging
demanding
tough
hard
easy
simple
straightforward
clear
obvious
apparent
evident
visible
invisible
hidden
secret
private
confidential
classified
restricted
limited
unlimited
infinite
finite
bounded
open
closed
locked
sealed
fixed
flexible
rigid
soft
hard
solid
liquid
gas
hot
cold
warm
cool
wet
dry
clean
dirty
pure
mixed
plain
fancy
simple
complex
rough
smooth
sharp
blunt
thick
thin
wide
narrow
broad
deep
shallow
tall
short
high
low
upper
lower
top
bottom
front
rear
inner
outer
central
peripheral
local
remote
near
far
close
distant
immediate
direct
indirect
straight
curved
round
square
flat
steep
level
sloping
horizontal
vertical
parallel
perpendicular
diagonal
circular
oval
rectangular
triangular
spherical
cubic
cylindrical
conical
abstract
concrete
general
specific
universal
particular
individual
collective
public
private
personal
impersonal
formal
informal
official
unofficial
legal
illegal
legitimate
illegitimate
valid
invalid
true
false
correct
incorrect
right
wrong
accurate
inaccurate
precise
approximate
exact
rough
detailed
brief
comprehensive
partial
complete
incomplete
whole
entire
total
full
empty
vacant
occupied
busy
idle
active
passive
positive
negative
neutral
favorable
unfavorable
beneficial
harmful
useful
useless
effective
ineffective
efficient
inefficient
productive
unproductive
successful
unsuccessful
profitable
unprofitable
valuable
worthless
expensive
cheap
costly
affordable
reasonable
unreasonable
fair
unfair
just
unjust
equal
unequal
balanced
unbalanced
stable
unstable
steady
unsteady
consistent
inconsistent
reliable
unreliable
dependable
undependable
trustworthy
untrustworthy
honest
dishonest
sincere
insincere
genuine
fake
authentic
artificial
natural
synthetic
organic
inorganic
living
dead
alive
deceased
animate
inanimate
conscious
unconscious
aware
unaware
awake
asleep
alert
drowsy
sober
drunk
sane
insane
rational
irrational
logical
illogical
reasonable
unreasonable
sensible
foolish
wise
stupid
intelligent
ignorant
smart
dumb
clever
naive
sophisticated
simple
educated
uneducated
literate
illiterate
skilled
unskilled
trained
untrained
experienced
inexperienced
qualified
unqualified
competent
incompetent
capable
incapable
able
unable
powerful
powerless
strong
weak
mighty
feeble
robust
frail
healthy
unhealthy
fit
unfit
sick
well
ill
sound
wounded
injured
hurt
damaged
broken
intact
whole
complete
perfect
imperfect
flawed
defective
faulty
sound
damaged
ruined
destroyed
demolished
wrecked
shattered
crushed
smashed
broken
cracked
split
torn
ripped
cut
sliced
chopped
ground
crushed
squeezed
pressed
compressed
expanded
stretched
extended
shortened
reduced
enlarged
increased
decreased
multiplied
divided
added
subtracted
combined
separated
mixed
blended
merged
split
divided
distributed
allocated
assigned
designated
appointed
elected
selected
chosen
picked
preferred
favored
rejected
excluded
eliminated
removed
deleted
erased
cancelled
revoked
withdrawn
suspended
postponed
delayed
advanced
accelerated
hastened
slowed
stopped
halted
paused
resumed
continued
proceeded
progressed
advanced
moved
shifted
transferred
transported
carried
conveyed
delivered
sent
received
obtained
acquired
gained
achieved
accomplished
completed
finished
ended
concluded
terminated
stopped
ceased
discontinued
abandoned
deserted
forsaken
left
departed
exited
escaped
fled
ran
walked
moved
traveled
journeyed
wandered
roamed
explored
discovered
found
located
identified
recognized
distinguished
differentiated
compared
contrasted
matched
fitted
suited
adapted
adjusted
modified
changed
altered
transformed
converted
translated
interpreted
explained
described
depicted
illustrated
demonstrated
showed
displayed
exhibited
presented
introduced
announced
declared
stated
said
told
spoke
talked
communicated
expressed
conveyed
transmitted
broadcast
published
printed
written
typed
recorded
registered
logged
noted
marked
labeled
tagged
named
called
titled
termed
designated
referred
mentioned
cited
quoted
referenced
indicated
pointed
directed
guided
led
conducted
managed
controlled
operated
handled
dealt
treated
processed
worked
functioned
performed
acted
behaved
conducted
carried
executed
implemented
applied
used
utilized
employed
exploited
harnessed
leveraged
capitalized
benefited
profited
gained
earned
made
produced
created
generated
developed
built
constructed
assembled
manufactured
fabricated
formed
shaped
molded
cast
forged
crafted
designed
planned
organized
arranged
prepared
equipped
supplied
provided
furnished
offered
gave
donated
contributed
invested
spent
paid
bought
purchased
acquired
obtained
secured
ensured
guaranteed
protected
defended
guarded
shielded
covered
wrapped
enclosed
surrounded
encircled
bordered
framed
outlined
defined
determined
decided
resolved
settled
solved
answered
responded
replied
reacted
acted
moved
operated
functioned
worked
ran
performed
executed
accomplished
achieved
attained
reached
arrived
came
got
obtained
received
accepted
took
grabbed
seized
caught
captured
trapped
confined
restricted
limited
constrained
bound
tied
attached
connected
linked
joined
united
combined
merged
integrated
incorporated
included
contained
comprised
consisted
formed
constituted
made
composed
created
produced
generated
caused
resulted
led
brought
gave
provided
offered
presented
showed
revealed
disclosed
exposed
uncovered
discovered
found
detected
identified
recognized
acknowledged
admitted
confessed
declared
announced
proclaimed
stated
asserted
claimed
maintained
argued
contended
insisted
emphasized
stressed
highlighted
underlined
underscored
reinforced
supported
backed
endorsed
approved
authorized
permitted
allowed
enabled
facilitated
helped
assisted
aided
supported
encouraged
motivated
inspired
stimulated
prompted
triggered
sparked
ignited
kindled
aroused
awakened
stirred
moved
touched
affected
influenced
impacted
changed
altered
modified
transformed
shaped
formed
molded
developed
evolved
grew
expanded
increased
rose
climbed
soared
jumped
leaped
surged
spiked
peaked
topped
exceeded
surpassed
outperformed
beat
defeated
conquered
overcame
surmounted
triumphed
prevailed
succeeded
won
gained
achieved
accomplished
completed
fulfilled
satisfied
met
matched
equaled
rivaled
competed
contended
fought
battled
struggled
strived
endeavored
attempted
tried
tested
examined
inspected
checked
verified
confirmed
validated
certified
approved
accepted
adopted
embraced
welcomed
greeted
received
hosted
entertained
amused
delighted
pleased
satisfied
gratified
rewarded
compensated
paid
remunerated
reimbursed
refunded
returned
restored
repaired
fixed
mended
corrected
rectified
amended
revised
updated
upgraded
improved
enhanced
enriched
augmented
supplemented
complemented
completed
finished
concluded
ended
terminated
closed
shut
sealed
locked
secured
fastened
attached
fixed
mounted
installed
positioned
placed
put
set
laid
rested
stood
sat
remained
stayed
continued
persisted
endured
lasted
survived
lived
existed
occurred
happened
took
arose
emerged
appeared
surfaced
materialized
manifested
developed
evolved
grew
matured
ripened
aged
deteriorated
declined
decayed
rotted
decomposed
disintegrated
crumbled
collapsed
fell
dropped
sank
descended
lowered
reduced
diminished
decreased
dwindled
shrank
contracted
narrowed
tightened
squeezed
compressed
condensed
concentrated
focused
centered
converged
met
joined
united
merged
blended
fused
melted
dissolved
evaporated
vaporized
sublimated
condensed
solidified
froze
hardened
stiffened
tightened
loosened
relaxed
eased
calmed
soothed
comforted
consoled
reassured
encouraged
supported
helped
aided
assisted
served
attended
cared
tended
nursed
treated
healed
cured
remedied
relieved
alleviated
eased
reduced
lessened
diminished
weakened
undermined
sabotaged
disrupted
disturbed
interrupted
interfered
obstructed
blocked
hindered
impeded
hampered
prevented
stopped
halted
checked
curbed
restrained
controlled
regulated
governed
ruled
commanded
ordered
directed
instructed
told
asked
requested
demanded
required
needed
wanted
desired
wished
hoped
expected
anticipated
predicted
forecasted
projected
estimated
calculated
computed
figured
determined
assessed
evaluated
appraised
judged
rated
ranked
graded
scored
measured
weighed
counted
numbered
quantified
qualified
characterized
described
defined
specified
detailed
outlined
summarized
reviewed
analyzed
examined
studied
investigated
researched
explored
probed
delved
dug
searched
sought
looked
hunted
pursued
chased
followed
tracked
traced
monitored
watched
observed
noticed
noted
remarked
commented
mentioned
referred
alluded
hinted
suggested
implied
inferred
deduced
concluded
reasoned
thought
believed
supposed
assumed
presumed
imagined
envisioned
visualized
pictured
conceived
understood
comprehended
grasped
realized
recognized
appreciated
valued
treasured
cherished
prized
esteemed
respected
admired
revered
worshipped
idolized
adored
loved
liked
enjoyed
appreciated
favored
preferred
chose
selected
picked
opted
decided
resolved
determined
committed
dedicated
devoted
pledged
promised
vowed
swore
guaranteed
assured
ensured
secured
protected
safeguarded
preserved
conserved
maintained
sustained
supported
upheld
defended
advocated
championed
promoted
advanced
furthered
fostered
nurtured
cultivated
developed
built
established
founded
created
instituted
launched
started
began
initiated
introduced
pioneered
originated
invented
devised
designed
conceived
formulated
drafted
composed
wrote
authored
penned
scripted
coded
programmed
developed
engineered
constructed
built
assembled
manufactured
produced
made
fabricated
fashioned
crafted
created
generated
yielded
bore
produced
resulted
caused
brought
induced
provoked
triggered
precipitated
hastened
expedited
accelerated
quickened
speeded
rushed
hurried
hastened
delayed
postponed
deferred
adjourned
suspended
interrupted
paused
stopped
halted
ceased
quit
abandoned
forsook
deserted
left
departed
exited
withdrew
retreated
retired
resigned
abdicated
relinquished
surrendered
yielded
conceded
admitted
acknowledged
recognized
accepted
agreed
consented
approved
endorsed
ratified
confirmed
validated
verified
authenticated
certified
accredited
licensed
authorized
empowered
enabled
permitted
allowed
let
granted
awarded
bestowed
conferred
presented
gave
donated
contributed
provided
supplied
furnished
equipped
outfitted
fitted
prepared
readied
arranged
organized
planned
scheduled
programmed
timed
synchronized
coordinated
harmonized
aligned
adjusted
calibrated
tuned
regulated
modulated
varied
changed
altered
modified
adapted
customized
tailored
personalized
individualized
specialized
differentiated
distinguished
separated
divided
split
partitioned
segmented
sectioned
categorized
classified
grouped
clustered
bundled
packaged
wrapped
covered
coated
painted
decorated
adorned
embellished
enhanced
improved
upgraded
modernized
renovated
refurbished
restored
repaired
fixed
mended
patched
sealed
plugged
filled
stuffed
packed
loaded
charged
fueled
powered
energized
activated
triggered
initiated
started
launched
fired
shot
threw
tossed
cast
hurled
pitched
flung
lobbed
catapulted
propelled
pushed
shoved
thrust
drove
forced
compelled
coerced
pressured
urged
persuaded
convinced
influenced
swayed
moved
motivated
inspired
encouraged
stimulated
excited
thrilled
delighted
pleased
satisfied
gratified
fulfilled
contented
appeased
pacified
placated
mollified
soothed
calmed
quieted
silenced
hushed
muted
muffled
dampened
softened
gentled
eased
lightened
brightened
illuminated
enlightened
informed
educated
taught
instructed
trained
coached
mentored
guided
advised
counseled
consulted
recommended
suggested
proposed
offered
submitted
presented
introduced
unveiled
revealed
disclosed
exposed
uncovered
discovered
detected
found
located
pinpointed
identified
recognized
spotted
noticed
observed
witnessed
saw
viewed
watched
monitored
surveyed
scanned
examined
inspected
scrutinized
studied
analyzed
dissected
probed
investigated
researched
explored
delved
penetrated
pierced
perforated
punctured
pricked
stabbed
cut
sliced
chopped
diced
minced
ground
crushed
mashed
pulverized
powdered
grated
shredded
tore
ripped
split
cracked
broke
smashed
shattered
splintered
fragmented
disintegrated
demolished
destroyed
ruined
wrecked
devastated
ravaged
pillaged
plundered
looted
ransacked
raided
attacked
assaulted
stormed
invaded
occupied
seized
captured
conquered
subdued
overpowered
overwhelmed
crushed
defeated
vanquished
routed
repelled
repulsed
rebuffed
rejected
refused
declined
denied
disputed
contested
challenged
opposed
resisted
fought
battled
combated
struggled
strived
endeavored
attempted
tried
ventured
risked
dared
braved
faced
confronted
encountered
met
engaged
involved
participated
joined
entered
enrolled
registered
signed
subscribed
committed
pledged
promised
vowed
swore
testified
declared
stated
affirmed
asserted
claimed
maintained
contended
argued
debated
discussed
talked
conversed
chatted
gossiped
whispered
murmured
muttered
mumbled
grumbled
complained
protested
objected
criticized
condemned
denounced
censured
blamed
accused
charged
indicted
prosecuted
sued
litigated
disputed
contested
challenged
appealed
petitioned
requested
asked
begged
pleaded
implored
entreated
beseeched
solicited
canvassed
campaigned
lobbied
advocated
promoted
advertised
marketed
sold
traded
exchanged
swapped
bartered
negotiated
bargained
dealt
transacted
conducted
managed
administered
supervised
oversaw
monitored
controlled
regulated
governed
ruled
commanded
directed
led
guided
steered
navigated
piloted
drove
operated
ran
executed
performed
carried
conducted
implemented
applied
exercised
practiced
used
utilized
employed
deployed
mobilized
marshaled
rallied
assembled
gathered
collected
accumulated
amassed
stockpiled
hoarded
stored
kept
retained
preserved
conserved
saved
rescued
salvaged
recovered
retrieved
reclaimed
regained
recaptured
retook
repossessed
recouped
reimbursed
refunded
repaid
returned
restored
reinstated
reestablished
reconstructed
rebuilt
regenerated
renewed
revived
resurrected
revitalized
rejuvenated
refreshed
recharged
reenergized
reinvigorated
reanimated
rekindled
reignited
relighted
relit
reheated
rewarmed
recooled
refroze
resolidified
remelted
redissolved
recrystallized
reprecipitated
resuspended
redissolved
reconstituted
rehydrated
reabsorbed
reassimilated
reintegrated
reincorporated
reincluded
readmitted
readopted
reaccepted
reapproved
reauthorized
relegitimized
revalidated
recertified
reaccredited
relicensed
reregistered
reenrolled
reenlisted
recommitted
rededicated
redevoted
refocused
recentered
realigned
readjusted
recalibrated
retuned
reregulated
remodulated
revaried
rechanged
realtered
remodified
readapted
recustomized
retailored
repersonalized
reindividualized
respecialized
redifferentiated
redistinguished
reseparated
redivided
resplit
repartitioned
resegmented
resectioned
recategorized
reclassified
regrouped
reclustered
rebundled
repackaged
rewrapped
recovered
recoated
repainted
redecorated
readorned
reembellished
reenhanced
reimproved
upgraded_again
remodernized
rerenovated
rerefurbished
rerestored
rerepaired
refixed
remended
repatched
resealed
replugged
refilled
restuffed
repacked
reloaded
recharged_again
refueled
repowered
reenergized_again
reactivated
retriggered
reinitiated
restarted
relaunched
refired
reshot
rethrew
retossed
recast
rehurled
repitched
reflung
relobbed
recatapulted
repropelled
repushed
reshoved
rethrust
redrove
reforced
recompelled
recoerced
repressured
reurged
repersuaded
reconvinced
reinfluenced
reswayed
removed_again
remotivated
reinspired
reencouraged
restimulated
reexcited
rethrilled
redelighted
repleased
resatisfied
regratified
refulfilled
recontented
reappeased
repacified
replacated
remollified
resoothed
recalmed
requieted
resilenced
rehushed
remuted
remuffled
redampened
resoftened
regentled
reeased
relightened
rebrightened
reilluminated
reenlightened
reinformed
reeducated
retaught
reinstructed
retrained
recoached
rementored
reguided
readvised
recounseled
reconsulted
rerecommended
resuggested
reproposed
reoffered
resubmitted
represented
reintroduced
reunveiled
rerevealed
redisclosed
reexposed
reuncovered
rediscovered
redetected
refound
relocated
repinpointed
reidentified
rerecognized
respotted
renoticed
reobserved
rewitnessed
resaw
reviewed_again
rewatched
remonitored
resurveyed
rescanned
reexamined
reinspected
rescrutinized
restudied
reanalyzed
redissected
reprobed
reinvestigated
reresearched
reexplored
redelved
repenetrated
repierced
reperforated
repunctured
repricked
restabbed
recut
resliced
rechopped
rediced
reminced
reground
recrushed
remashed
repulverized
repowdered
regrated
reshredded
retore
reripped
resplit
recracked
rebroke
resmashed
reshattered
resplintered
refragmented
redisintegrated
redemolished
redestroyed
reruined
rewrecked
redevastated
reravaged
repillaged
replundered
relooted
reransacked
reraided
reattacked
reassaulted
restormed
reinvaded
reoccupied
reseized
recaptured
reconquered
resubdued
reoverpowered
reoverwhelmed
recrushed_again
redefeated
revanquished
rerouted
rerepelled
rerepulsed
rerebuffed
rerejected
rerefused
redeclined
redenied
redisputed
recontested
rechallenged
reopposed
reresisted
refought
rebattled
recombated
restruggled
restrived
reendeavored
reattempted
retried
reventured
rerisked
redared
rebraved
refaced
reconfronted
reencountered
remet
reengaged
reinvolved
reparticipated
rejoined
reentered
reenrolled_again
reregistered_again
resigned_again
resubscribed
recommitted_again
repledged
repromised
revowed
reswore
retestified
redeclared
restated
reaffirmed
reasserted
reclaimed
remaintained
recontended
reargued
redebated
rediscussed
retalked
reconversed
rechatted
regossiped
rewhispered
remurmured
remuttered
remumbled
regrumbled
recomplained
reprotested
reobjected
recriticized
recondemned
redenounced
recensured
reblamed
reaccused
recharged_legal
reindicted
reprosecuted
resued
relitigated
redisputed_again
recontested_again
rechallenged_again
repealed_again
repetitioned
rerequested
reasked
rebegged
repleaded
reimplored
reenreated
rebeseeched
resolicited
recanvassed
recampaigned
lobbied_again
readvocated
repromoted
readvertised
remarketed
resold
retraded
reexchanged
reswapped
rebartered
renegotiated
rebargained
redealt
retransacted
reconducted
remanaged
readministered
resupervised
reoversawed
remonitored_again
recontrolled
reregulated
regoverned
reruled
recommanded
redirected
reled
reguided_again
resteered
renavigated
repiloted
redrove_again
reoperated
reran
reexecuted
reperformed
recarried
reconducted_again
reimplemented
reapplied
reexercised
repracticed
reused
reutilized
reemployed
redeployed
remobilized
remarshaled
rerallied
reassembled
regathered
recollected
reaccumulated
reamassed
restockpiled
rehoarded
restored_storage
rekept
reretained
represerved
reconserved
resaved
rerescued
resalvaged
rerecovered
reretrieved
rereclaimed
reregained
rerecaptured
retook_again
rerepossessed
rerecouped
rereimbursed
rerefunded
rerepaid
rereturned
rerestored_again
reinstated_again
reestablished_again
rerevitalized