name: "speech_recognizer"
platform: "pytorch_libtorch"
max_batch_size: 1

input {
  name: "audio_input"
  data_type: TYPE_FP32
  dims: [16000]
}

output {
  name: "transcription"
  data_type: TYPE_STRING
  dims: [1]
}

version_policy {
  specific {
    versions: 3
    versions: 5
  }
}