name: "face_recognition"
platform: "tensorrt_plan"
max_batch_size: 8

input [
  {
    name: ""
    data_type: TYPE_FP32
    dims: [112, 112, 3]
  }
]

output [
  {
    name: "embeddings"
    data_type: TYPE_INVALID
    dims: [-1, 512]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]