the
a
and
of
to
is
in
it
that
this
was
for
on
with
as
movie
film
but
not
have
are
be
at
from
or
an
by
one
has
his
her
they
which
you
all
were
their
we
can
had
more
been
about
so
who
into
would
time
there
he
she
when
up
its
out
if
what
some
them
only
other
than
then
now
my
over
also
will
very
see
just
like
good
bad
great
best
excellent
worst
love
hate
amazing
terrible
awful
perfect
brilliant
fantastic
horrible
wonderful
poor
superb
boring
exciting
dull
mediocre
disappointing
tedious
enjoyed
waste
plot
story
character
characters
acting
performance
performances
scene
scenes
director
actor
actors
actress
watch
watching
watching
watched
star
stars
rating
review
audience
theater
theatre
cinema
screen
show
series
episode
minutes
hour
hours
end
ending
beginning
start
middle
first
last
second
third
new
old
young
original
classic
modern
action
drama
comedy
horror
thriller
romance
adventure
fantasy
science
fiction
documentary
animation
musical
crime
mystery
war
western
family
sport
biography
history
short
long
full
major
main
small
big
large
little
high
low
right
wrong
true
false
real
fake
life
world
man
woman
men
women
child
children
people
person
human
friend
friends
father
mother
son
daughter
brother
sister
wife
husband
family
love
death
dead
die
dies
died
kill
killed
killing
blood
violence
violent
fight
fighting
war
battle
gun
guns
weapon
weapons
police
cop
cops
detective
crime
criminal
murder
murderer
victim
case
investigation
suspect
evidence
trial
court
law
lawyer
judge
jury
prison
jail
escape
chase
shot
shoot
shooting
explosion
car
cars
vehicle
house
home
room
door
window
street
city
town
country
place
world
earth
space
planet
ship
boat
plane
train
travel
journey
trip
night
day
morning
evening
dark
darkness
light
bright
black
white
red
blue
green
yellow
color
colors
music
sound
sounds
song
songs
voice
voices
dialogue
line
lines
word
words
speak
speaking
spoken
said
say
says
tell
told
talk
talking
scream
screaming
laugh
laughing
cry
crying
smile
feel
feeling
feelings
emotion
emotional
emotions
happy
sad
angry
fear
scared
afraid
surprise
surprised
funny
fun
humor
humorous
serious
dark
deep
powerful
strong
weak
intense
slow
fast
quick
pace
pacing
tension
suspense
twist
twists
surprise
unexpected
predictable
obvious
original
unique
different
same
similar
usual
unusual
special
ordinary
extraordinary
incredible
unbelievable
believable
realistic
unrealistic
convincing
unconvincing
credible
plausible
impossible
possible
likely
unlikely
good
better
worse
bad
excellent
terrible
great
awful
amazing
horrible
fantastic
brilliant
wonderful
poor
superb
perfect
worst
best
favorite
masterpiece
gem
classic
must
recommended
recommend
worth
worthy
worthwhile
waste
wasted
wasting
disappointment
disappointed
disappointing
expect
expected
expecting
expectations
hope
hoped
hoping
surprise
surprised
surprising
impress
impressed
impressive
disappoint
enjoy
enjoyed
enjoying
enjoyable
entertainment
entertaining
entertain
bore
bored
boring
interest
interested
interesting
uninteresting
engage
engaged
engaging
captivate
captivating
fascinate
fascinating
compel
compelling
grip
gripping
absorb
absorbing
riveting
thrilling
exciting
dull
tedious
tiresome
monotonous
repetitive
slow
draggy
long
short
runtime
length
duration
minute
minutes
hour
hours
script
screenplay
writing
written
write
writer
writers
dialogue
dialogues
story
storyline
plot
narrative
tale
arc
structure
develop
development
character
characterization
protagonist
antagonist
villain
hero
heroine
lead
leads
supporting
role
roles
cast
ensemble
chemistry
direction
directed
direct
director
directors
helm
vision
visual
visuals
visually
cinematography
cinematographer
shot
shots
camera
camerawork
angle
angles
frame
framing
composition
lighting
lit
color
colors
palette
aesthetic
style
stylish
stylized
look
looks
beautiful
beauty
gorgeous
stunning
striking
impressive
spectacular
breathtaking
ugly
bland
generic
forgettable
memorable
unforgettable
iconic
moment
moments
sequence
sequences
scene
scenes
act
acts
action
actions
fight
fights
battle
battles
chase
chases
stunt
stunts
effect
effects
special
practical
cgi
computer
generated
graphic
graphics
animation
animated
realistic
unrealistic
cheap
cheesy
corny
cringe
cringy
awkward
clumsy
polished
professional
amateur
budget
production
quality
values
sound
soundtrack
score
music
musical
composer
song
songs
theme
themes
tone
tonal
mood
atmosphere
atmospheric
feel
feeling
vibe
sense
emotion
emotional
emotionally
heart
heartfelt
touching
moving
powerful
impact
impactful
profound
deep
shallow
superficial
substance
meaningful
meaningless
message
messages
theme
themes
subtext
symbolism
symbolic
metaphor
metaphorical
literal
subtle
subtlety
obvious
heavy
handed
preach
preachy
pretentious
sincere
genuine
authentic
fake
artificial
forced
natural
organic
fresh
new
original
originality
unique
cliche
cliched
trope
tropes
formula
formulaic
conventional
unconventional
innovative
creative
creativity
imagination
imaginative
inspired
inspiration
derivative
copy
copied
rip
ripoff
homage
tribute
reference
references
influence
influenced
version
adaptation
adapted
book
novel
based
remake
reboot
sequel
prequel
franchise
series
installment
part
chapter
continue
continuation
standalone
independent
compare
comparison
compared
similar
difference
different
better
worse
equal
match
live
lives
exceed
surpass
fall
short
deliver
delivers
fail
fails
succeed
success
successful
failure
flop
hit
blockbuster
sleeper
underrated
overrated
rated
rating
ratings
hype
hyped
buzz
anticipation
anticipated
expect
expected
disappointment
letdown
satisfying
satisfaction
satisfy
unsatisfying
fulfilling
rewarding
gratifying
please
pleased
pleasing
displease
work
works
worked
working
effective
effectively
ineffective
try
tries
tried
trying
attempt
attempts
succeed
success
fail
failure
manage
manages
problem
problems
issue
issues
flaw
flaws
flawed
mistake
mistakes
error
errors
fault
faults
strength
strengths
weakness
weaknesses
strong
weak
point
points
positive
negative
pro
pros
con
cons
aspect
aspects
element
elements
part
parts
portion
side
factor
factors
reason
reasons
why
because
due
thanks
despite
although
though
however
unfortunately
fortunately
sadly
happily
glad
sorry
wish
wishes
wished
hope
hopes
hoped
think
thinks
thought
believe
believes
believed
feel
feels
felt
seem
seems
seemed
appear
appears
appeared
look
looks
looked
suppose
supposed
guess
guessed
imagine
imagined
wonder
wondered
question
questions
doubt
doubts
sure
certain
uncertain
unclear
clear
obvious
evident
apparent
understand
understood
understanding
confuse
confused
confusing
confusion
make
makes
made
sense
nonsense
logic
logical
illogical
reason
reasonable
unreasonable
justify
justified
explanation
explain
explained
coherent
incoherent
consistent
inconsistent
continuity
error
hole
holes
contrivance
convenient
convenience
coincidence
coincidental
believable
unbelievable
suspend
disbelief
buy
bought
accept
accepted
acceptable
unacceptable
tolerate
tolerable
intolerable
stand
stood
bear
endure
sit
sat
through
watch
watched
viewing
view
viewed
see
seen
saw
seeing
look
looked
looking
pay
paid
attention
focus
focused
concentrate
concentrated
distract
distracted
distracting
distraction
lose
lost
interest
engage
engagement
involved
involvement
invest
invested
investment
care
cared
caring
concern
concerned
root
rooted
rooting
sympathize
sympathy
empathize
empathy
relate
related
relatable
connection
connect
connected
disconnect
disconnected
alienate
alienated
distance
distant
close
closeness
intimate
intimacy
relationship
bond
attach
attached
attachment
detach
detached
feel
felt
feeling
feelings
think
thought
thoughts
mind
mental
psychological
physical
visual
visceral
intellectual
smart
intelligent
clever
stupid
dumb
idiotic
moronic
brilliant
genius
wise
foolish
naive
sophisticated
simple
complex
complexity
complicate
complicated
straightforward
convoluted
messy
clean
tight
loose
trim
fat
lean
bloat
bloated
excess
excessive
indulgent
restrain
restrained
restraint
control
controlled
wild
crazy
insane
mad
sane
normal
abnormal
weird
strange
odd
peculiar
bizarre
outlandish
conventional
traditional
experimental
avant
garde
mainstream
niche
cult
arthouse
commercial
artistic
art
popcorn
crowd
pleaser
please
entertain
fun
serious
light
heavy
dark
bright
uplifting
depressing
depress
depressed
grim
bleak
hopeful
hopeless
optimistic
pessimistic
positive
negative
upbeat
downbeat
cheerful
somber
gloomy
sunny
warm
cold
hot
cool
chill
cozy
comfortable
uncomfortable
easy
difficult
hard
tough
challenge
challenging
demanding
effortless
simple
complicated
accessible
inaccessible
approachable
dense
thick
thin
rich
poor
full
empty
packed
sparse
abundant
scarce
plenty
lack
lacking
miss
missing
absent
present
include
included
inclusion
exclude
excluded
exclusion
feature
features
contain
contains
contained
offer
offers
offered
provide
provides
provided
give
gives
gave
given
bring
brings
brought
take
takes
took
taken
add
adds
added
addition
subtract
remove
removed
removal
keep
keeps
kept
maintain
maintained
lose
loses
lost
gain
gained
retain
retained
preserve
preserved
destroy
destroyed
destruction
create
created
creation
build
built
construct
constructed
break
broke
broken
fix
fixed
repair
repaired
damage
damaged
harm
harmed
help
helped
helpful
unhelpful
useful
useless
serve
served
purpose
point
pointless
meaning
meaningful
meaningless
matter
mattered
important
importance
unimportant
significant
significance
insignificant
relevant
relevance
irrelevant
necessary
unnecessary
essential
inessential
vital
crucial
critical
key
minor
major
trivial
substantial
considerable
negligible
notable
noteworthy
remarkable
unremarkable
ordinary
extraordinary
exceptional
unexceptional
average
mediocre
subpar
adequate
inadequate
sufficient
insufficient
enough
plenty
lack
plenty
ample
scarce
rare
common
usual
unusual
typical
atypical
standard
nonstandard
normal
abnormal
regular
irregular
frequent
infrequent
often
rarely
seldom
never
always
sometimes
occasionally
constantly
continuously
continuous
sporadic
intermittent
steady
unsteady
stable
unstable
consistent
inconsistent
reliable
unreliable
dependable
undependable
trustworthy
untrustworthy
honest
dishonest
true
false
truth
lie
lies
real
fake
genuine
phony
authentic
inauthentic
sincere
insincere
earnest
sarcastic
ironic
irony
satire
satirical
parody
spoof
mockery
mock
serious
joke
humorous
comic
comedic
tragic
tragedy
sad
sadness
happy
happiness
joy
joyful
joyous
sorrow
sorrowful
grief
mourn
mourning
celebrate
celebration
victory
defeat
win
winner
lose
loser
triumph
triumphant
fail
failure
succeed
success
achieve
achievement
accomplish
accomplishment
reach
reached
attain
attained
goal
goals
aim
aims
objective
objectives
target
targets
plan
plans
scheme
plot
intention
intentions
intend
intended
mean
meant
purpose
purposes
reason
reasons
cause
causes
effect
effects
result
results
consequence
consequences
outcome
outcomes
conclusion
conclusions
end
ending
finish
finished
complete
completed
completion
incomplete
unfinished
whole
partial
part
piece
pieces
fragment
fragments
bit
bits
section
sections
segment
segments
portion
portions
share
shares
division
divide
divided
unite
united
unity
separate
separated
separation
together
apart
join
joined
junction
split
splits
merge
merged
merger
combine
combined
combination
mix
mixed
mixture
blend
blended
fuse
fused
fusion
integrate
integrated
integration
isolate
isolated
isolation
alone
lonely
solitary
sole
single
double
triple
multiple
many
few
several
some
any
all
none
every
each
both
either
neither
one
two
three
four
five
six
seven
eight
nine
ten
hundred
thousand
million
billion
number
numbers
amount
amounts
quantity
quantities
total
sum
whole
entire
complete
full
half
quarter
third
fourth
fifth
percent
percentage
ratio
proportion
rate
degree
level
extent
measure
measurement
size
scale
scope
range
spectrum
variety
diversity
diverse
varied
various
different
same
similar
alike
like
unlike
resemble
resemblance
compare
comparison
contrast
contrasting
opposite
opposed
opposition
conflict
conflicting
agree
agreement
disagree
disagreement
match
mismatch
fit
fits
fitting
suit
suits
suitable
unsuitable
appropriate
inappropriate
proper
improper
right
wrong
correct
incorrect
accurate
inaccurate
precise
imprecise
exact
inexact
approximate
roughly
about
around
near
nearly
close
closely
far
distant
remote
immediate
direct
indirect
straight
curved
round
square
circle
triangle
shape
shapes
form
forms
figure
figures
image
images
picture
pictures
photo
photos
photograph
scene
scenery
landscape
background
foreground
front
back
behind
ahead
forward
backward
reverse
side
sides
top
bottom
above
below
under
over
high
low
up
down
left
right
center
middle
edge
edges
corner
corners
border
borders
boundary
boundaries
limit
limits
limitation
limitations
restrict
restricted
restriction
restrictions
confine
confined
bound
bounded
free
freedom
liberate
liberated
liberation
release
released
trap
trapped
capture
captured
catch
caught
hold
held
grip
gripped
grasp
grasped
grab
grabbed
seize
seized
take
took
taken
give
gave
given
offer
offered
present
presented
show
showed
shown
display
displayed
exhibit
exhibited
reveal
revealed
hide
hidden
conceal
concealed
cover
covered
uncover
uncovered
expose
exposed
discover
discovered
find
found
search
searched
seek
sought
look
looked
hunt
hunted
track
tracked
follow
followed
lead
led
guide
guided
direct
directed
point
pointed
indicate
indicated
sign
signs
signal
signals
mark
marks
symbol
symbols
represent
represented
representation
stand
stood
mean
meant
meaning
meanings
signify
significance
imply
implied
implication
implications
suggest
suggested
suggestion
suggestions
hint
hints
clue
clues
evidence
proof
demonstrate
demonstrated
prove
proved
proven
disprove
disproved
show
showed
shown
illustrate
illustrated
example
examples
instance
instances
case
cases
situation
situations
circumstance
circumstances
condition
conditions
state
states
status
position
positions
place
places
location
locations
spot
spots
site
sites
area
areas
region
regions
zone
zones
territory
district
neighborhood
vicinity
space
spaces
room
rooms
capacity
volume
mass
weight
heavy
light
dense
sparse
thick
thin
wide
narrow
broad
slim
fat
large
small
big
little
huge
tiny
enormous
minute
giant
dwarf
massive
minuscule
vast
limited
immense
negligible
grand
modest
great
small
major
minor
prime
secondary
primary
auxiliary
main
side
chief
subordinate
leading
supporting
principal
ancillary
central
peripheral
core
fringe
heart
edge
essence
surface
substance
appearance
reality
actuality
fantasy
dream
nightmare
illusion
delusion
hallucination
vision
sight
view
perspective
angle
viewpoint
standpoint
position
stance
attitude
approach
method
way
manner
style
fashion
mode
technique
strategy
tactic
plan
scheme
design
pattern
model
template
framework
structure
system
organization
arrangement
order
sequence
series
progression
development
evolution
growth
decline
rise
fall
increase
decrease
gain
loss
improve
improvement
worsen
deteriorate
deterioration
enhance
enhancement
diminish
reduction
expand
expansion
contract
contraction
extend
extension
shorten
lengthen
widen
narrow
broaden
deepen
shallow
heighten
lower
raise
drop
lift
sink
float
fly
fall
rise
climb
descend
ascend
mount
dismount
board
embark
disembark
arrive
arrival
depart
departure
leave
left
stay
stayed
remain
remained
go
went
gone
come
came
return
returned
visit
visited
travel
traveled
journey
trip
voyage
expedition
adventure
quest
mission
task
job
work
labor
effort
endeavor
enterprise
undertaking
project
program
initiative
campaign
operation
activity
action
deed
act
performance
execution
implementation
application
practice
exercise
drill
training
preparation
ready
prepared
unprepared
plan
planned
organize
organized
arrange
arranged
set
setup
establish
established
found
founded
start
started
begin
began
begun
initiate
initiated
launch
launched
introduce
introduced
open
opened
close
closed
shut
end
ended
finish
finished
complete
completed
conclude
concluded
terminate
terminated
stop
stopped
cease
ceased
halt
halted
pause
paused
continue
continued
resume
resumed
proceed
proceeded
advance
advanced
progress
progressed
move
moved
motion
movement
shift
shifted
change
changed
alter
altered
modification
modify
modified
transform
transformed
transformation
convert
converted
conversion
transition
switch
switched
exchange
exchanged
replace
replaced
replacement
substitute
substitution
swap
swapped
trade
traded
deal
dealt
transaction
transfer
transferred
transmit
transmitted
send
sent
receive
received
get
got
gotten
obtain
obtained
acquire
acquired
gain
gained
earn
earned
win
won
achieve
achieved
attain
attained
secure
secured
procure
procured
purchase
purchased
buy
bought
sell
sold
sale
sales
market
markets
store
stores
shop
shops
business
commerce
trade
industry
company
companies
corporation
firm
organization
institution
establishment
agency
office
department
branch
division
unit
group
team
crew
staff
personnel
employee
employees
worker
workers
member
members
participant
participants
player
players
partner
partners
colleague
colleagues
associate
associates
companion
companions
ally
allies
friend
friends
enemy
enemies
foe
foes
rival
rivals
opponent
opponents
competitor
competitors
adversary
adversaries
antagonist
hero
protagonist
character
role
figure
individual
person
people
human
humans
being
beings
creature
creatures
animal
animals
beast
beasts
monster
monsters
demon
demons
devil
angel
angels
god
gods
goddess
spirit
spirits
ghost
ghosts
soul
souls
mind
minds
body
bodies
flesh
bone
bones
blood
heart
hearts
brain
brains
eye
eyes
ear
ears
nose
mouth
face
faces
head
heads
hand
hands
finger
fingers
arm
arms
leg
legs
foot
feet
skin
hair
voice
voices
breath
breathe
breathing
live
living
life
lives
death
dead
die
died
dying
kill
killed
killing
murder
suicide
survive
survived
survival
exist
existed
existence
born
birth
grow
grew
grown
growth
age
aged
aging
young
youth
old
elder
adult
child
children
baby
babies
infant
toddler
teen
teenager
adolescent
mature
maturity
immature
develop
developed
developing
development
evolve
evolved
evolution
change
changed
changing
become
became
turn
turned
transform
transformed
shift
shifted
adapt
adapted
adaptation
adjust
adjusted
adjustment
modify
modified
modification
alter
altered
alteration
vary
varied
variation
differ
differed
difference
distinguish
distinguished
separate
separated
divide
divided
split
unite
united
unify
unified
join
joined
connect
connected
link
linked
attach
attached
bind
bound
tie
tied
fasten
fastened
secure
secured
fix
fixed
lock
locked
unlock
unlocked
open
opened
close
closed
seal
sealed
break
broke
broken
crack
cracked
shatter
shattered
smash
smashed
crush
crushed
destroy
destroyed
ruin
ruined
damage
damaged
harm
harmed
hurt
injure
injured
injury
wound
wounded
pain
painful
suffer
suffered
suffering
agony
torture
torment
tormented
ache
aching
sore
heal
healed
healing
cure
cured
treat
treated
treatment
remedy
recover
recovered
recovery
restore
restored
restoration
repair
repaired
fix
fixed
mend
mended
help
helped
helping
aid
aided
assist
assisted
assistance
support
supported
backing
protect
protected
protection
defend
defended
defense
guard
guarded
shield
shielded
save
saved
rescue
rescued
deliver
delivered
deliverance
free
freed
freedom
liberate
liberated
release
released
escape
escaped
flee
fled
run
ran
running
walk
walked
walking
step
steps
pace
move
moved
moving
movement
motion
travel
traveled
journey
trip
go
went
gone
going
come
came
coming
arrive
arrived
arrival
reach
reached
enter
entered
entrance
exit
exited
leave
left
leaving
depart
departed
departure
stay
stayed
staying
remain
remained
remaining
rest
rested
resting
sit
sat
sitting
stand
stood
standing
lie
lay
lain
lying
sleep
slept
sleeping
wake
woke
woken
awake
dream
dreamed
dreaming
nightmare
eat
ate
eaten
eating
drink
drank
drunk
drinking
food
meal
meals
breakfast
lunch
dinner
taste
tasted
tasting
flavor
delicious
tasty
yummy
disgusting
gross
nasty
sweet
sour
bitter
salty
spicy
hot
cold
warm
cool
fresh
stale
rotten
cook
cooked
cooking
bake
baked
fry
fried
boil
boiled
grill
grilled
roast
roasted
prepare
prepared
preparation
serve
served
serving
plate
dish
dishes
cup
glass
bottle
water
juice
coffee
tea
milk
beer
wine
alcohol
drunk
sober
intoxicated
smell
smelled
smelling
scent
odor
fragrance
perfume
stink
stench
hear
heard
hearing
listen
listened
listening
sound
sounds
noise
noises
loud
quiet
silent
silence
whisper
whispered
shout
shouted
yell
yelled
scream
screamed
cry
cried
crying
weep
wept
weeping
sob
sobbed
sobbing
laugh
laughed
laughing
laughter
giggle
giggled
chuckle
chuckled
smile
smiled
smiling
grin
grinned
frown
frowned
speak
spoke
spoken
speaking
talk
talked
talking
say
said
saying
tell
told
telling
ask
asked
asking
answer
answered
question
questioned
reply
replied
respond
responded
response
communicate
communication
conversation
discuss
discussed
discussion
debate
debated
argue
argued
argument
fight
fought
fighting
quarrel
dispute
disagree
disagreement
agree
agreed
agreement
consent
approve
approved
approval
disapprove
disapproved
accept
accepted
reject
rejected
refusal
refuse
refused
deny
denied
denial
admit
admitted
confess
confessed
confession
declare
declared
declaration
announce
announced
announcement
proclaim
proclaimed
state
stated
statement
claim
claimed
assert
asserted
assertion
maintain
maintained
insist
insisted
argue
argued
contend
contended
affirm
affirmed
confirm
confirmed
confirmation
verify
verified
prove
proved
proven
demonstrate
demonstrated
show
showed
shown
establish
established
support
supported
evidence
substantiate
validate
validated
attest
testify
testified
testimony
witness
witnesses
swear
sworn
oath
promise
promised
vow
vowed
pledge
pledged
guarantee
guaranteed
assure
assured
ensure
ensured
certain
certainty
sure
unsure
doubt
doubted
doubtful
question
questionable
suspect
suspected
suspicious
trust
trusted
trusting
distrust
distrusted
mistrust
mistrusted
believe
believed
believing
belief
disbelieve
disbelieved
faith
faithful
unfaithful
loyal
loyalty
disloyal
betray
betrayed
betrayal
deceive
deceived
deception
trick
tricked
fool
fooled
cheat
cheated
lie
lied
honest
honesty
dishonest
true
truth
false
falsehood
real
reality
fake
pretend
pretended
act
acted
perform
performed
play
played
role
character
portray
portrayed
depict
depicted
represent
represented
show
illustrate
describe
described
description
explain
explained
explanation
detail
details
account
relate
related
narrate
narrated
story
tale
tell
told
recount
recounted
report
reported
inform
informed
information
news
notify
notified
notice
noticed
observe
observed
observation
see
saw
seen
sight
view
viewed
watch
watched
look
looked
glance
glanced
stare
stared
gaze
gazed
peer
peered
glimpse
glimpsed
spot
spotted
detect
detected
discern
discerned
perceive
perceived
perception
recognize
recognized
identify
identified
distinguish
distinguished
note
noted
remark
remarked
comment
commented
mention
mentioned
refer
referred
reference
allude
alluded
hint
hinted
suggest
suggested
imply
implied
indicate
indicated
point
pointed
signal
signaled
gesture
gestured
nod
nodded
shake
shook
shaken
wave
waved
beckon
beckoned
motion
motioned
move
moved
movement
action
act
activity
behavior
conduct
manner
way
style
approach
method
technique
process
procedure
practice
custom
habit
routine
pattern
tendency
inclination
preference
choose
chose
chosen
choice
select
selected
selection
pick
picked
decide
decided
decision
determine
determined
resolve
resolved
settle
settled
conclude
concluded
judge
judged
judgment
assess
assessed
assessment
evaluate
evaluated
evaluation
estimate
estimated
calculate
calculated
measure
measured
weigh
weighed
consider
considered
consideration
think
thought
reflect
reflected
reflection
ponder
pondered
contemplate
contemplated
meditate
meditated
muse
mused
wonder
wondered
speculate
speculated
suppose
supposed
assume
assumed
assumption
presume
presumed
guess
guessed
imagine
imagined
fancy
dream
envision
envisioned
picture
pictured
visualize
visualized
conceive
conceived
understand
understood
comprehend
comprehended
grasp
grasped
realize
realized
recognize
apprehend
know
knew
known
knowledge
aware
awareness
conscious
consciousness
unconscious
ignore
ignored
ignorance
ignorant
unaware
oblivious
forget
forgot
forgotten
remember
remembered
recall
recalled
recollect
recollected
remind
reminded
memory
memories
memorize
memorized
learn
learned
learning
study
studied
teach
taught
teaching
instruct
instructed
educate
educated
education
train
trained
training
practice
practiced
exercise
exercised
drill
drilled
rehearse
rehearsed
prepare
prepared
ready
skill
skills
ability
abilities
capable
capacity
talent
talented
gift
gifted
genius
expert
master
professional
amateur
novice
beginner
experienced
inexperienced
competent
incompetent
qualified
unqualified
able
unable
can
could
may
might
shall
should
will
would
must
ought
need
needed
require
required
want
wanted
wish
wished
desire
desired
hope
hoped
expect
expected
anticipate
anticipated
await
awaited
wait
waited
long
longed
yearn
yearned
crave
craved
hunger
thirst
seek
sought
search
searched
pursue
pursued
chase
chased
hunt
hunted
strive
strove
try
tried
attempt
attempted
endeavor
endeavored
effort
struggle
struggled
fight
fought
battle
battled
compete
competed
contest
rival
oppose
opposed
resist
resisted
defy
defied
challenge
challenged
confront
confronted
face
faced
meet
met
encounter
encountered
deal
dealt
handle
handled
manage
managed
cope
coped
tackle
tackled
address
addressed
solve
solved
resolution
resolve
resolved
settle
settled
fix
fixed
repair
repaired
correct
corrected
amend
amended
remedy
remedied
improve
improved
better
enhance
enhanced
upgrade
upgraded
refine
refined
perfect
perfected
optimize
optimized
maximize
maximized
increase
increased
boost
boosted
raise
raised
elevate
elevated
advance
advanced
promote
promoted
further
develop
developed
grow
grew
grown
expand
expanded
extend
extended
enlarge
enlarged
broaden
broadened
widen
widened
spread
decrease
decreased
reduce
reduced
lower
lowered
diminish
diminished
lessen
lessened
minimize
minimized
shrink
shrank
contract
contracted
narrow
narrowed
limit
limited
restrict
restricted
constrain
constrained
confine
confined
control
controlled
regulate
regulated
govern
governed
rule
ruled
command
commanded
order
ordered
direct
directed
manage
guide
guided
lead
led
supervise
supervised
oversee
oversaw
monitor
monitored
check
checked
inspect
inspected
examine
examined
review
reviewed
survey
surveyed
study
studied
analyze
analyzed
investigate
investigated
explore
explored
research
researched
inquire
inquired
probe
probed
test
tested
experiment
experimented
trial
try
tried